[Survived] StringLiteral
src/domain/raci.service.ts:35:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const assignmentResult = await c.query(
-        `SELECT ${RACI_SELECT}
-           FROM dos.team_raci_assignments ra
-           JOIN dos.teams t ON t.team_id = ra.team_id
-          WHERE ra.tenant_id = $1
-            AND ra.user_id = $2
-            AND ra.revoked_at IS NULL
-          ORDER BY ra.scope_type, ra.raci_role`,
+        ``,
         [tenantId, userId],
       );

[Killed] ObjectLiteral
src/domain/raci.service.ts:56:14
         [tenantId, userId],
       );
 
-      return {
-        assignments: assignmentResult.rows as RaciAssignment[],
-        summary: summaryResult.rows as RaciSummaryEntry[],
-      };
+      return {};
     });
   } finally {
killedBy: raci.service getRaciByUser returns assignments + summary
statusReason: Target cannot be null or undefined.

[Survived] BlockStatement
src/domain/raci.service.ts:61:13
         summary: summaryResult.rows as RaciSummaryEntry[],
       };
     });
-  } finally {
-    userMetrics.observeDb('raci.getByUser', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/raci.service.ts:62:45
       };
     });
   } finally {
-    userMetrics.observeDb('raci.getByUser', Date.now() - start);
+    userMetrics.observeDb('raci.getByUser', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/raci.service.ts:69:30
 export async function getRaciByTeam(
   tenantId: string,
   teamId: string,
-): Promise<RaciAssignment[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${RACI_SELECT}
-           FROM dos.team_raci_assignments ra
-           JOIN dos.teams t ON t.team_id = ra.team_id
-          WHERE ra.tenant_id = $1
-            AND ra.team_id = $2
-            AND ra.revoked_at IS NULL
-          ORDER BY ra.raci_role`,
-        [tenantId, teamId],
-      );
-      return result.rows as RaciAssignment[];
-    });
-  } finally {
-    userMetrics.observeDb('raci.getByTeam', Date.now() - start);
-  }
-}
+): Promise<RaciAssignment[]> {}
 
 export async function assignRaci(
killedBy: raci.service getRaciByTeam scopes by tenant + team + revoked_at IS NULL
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/raci.service.ts:71:7
   teamId: string,
 ): Promise<RaciAssignment[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${RACI_SELECT}
-           FROM dos.team_raci_assignments ra
-           JOIN dos.teams t ON t.team_id = ra.team_id
-          WHERE ra.tenant_id = $1
-            AND ra.team_id = $2
-            AND ra.revoked_at IS NULL
-          ORDER BY ra.raci_role`,
-        [tenantId, teamId],
-      );
-      return result.rows as RaciAssignment[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('raci.getByTeam', Date.now() - start);
   }
killedBy: raci.service getRaciByTeam scopes by tenant + team + revoked_at IS NULL
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/raci.service.ts:72:58
 ): Promise<RaciAssignment[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${RACI_SELECT}
-           FROM dos.team_raci_assignments ra
-           JOIN dos.teams t ON t.team_id = ra.team_id
-          WHERE ra.tenant_id = $1
-            AND ra.team_id = $2
-            AND ra.revoked_at IS NULL
-          ORDER BY ra.raci_role`,
-        [tenantId, teamId],
-      );
-      return result.rows as RaciAssignment[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('raci.getByTeam', Date.now() - start);
killedBy: raci.service getRaciByTeam scopes by tenant + team + revoked_at IS NULL
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] StringLiteral
src/domain/raci.service.ts:74:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `SELECT ${RACI_SELECT}
-           FROM dos.team_raci_assignments ra
-           JOIN dos.teams t ON t.team_id = ra.team_id
-          WHERE ra.tenant_id = $1
-            AND ra.team_id = $2
-            AND ra.revoked_at IS NULL
-          ORDER BY ra.raci_role`,
+        ``,
         [tenantId, teamId],
       );
killedBy: raci.service getRaciByTeam scopes by tenant + team + revoked_at IS NULL
statusReason: expected '' to match /ra.tenant_id = \$1/

[Survived] BlockStatement
src/domain/raci.service.ts:85:13
       );
       return result.rows as RaciAssignment[];
     });
-  } finally {
-    userMetrics.observeDb('raci.getByTeam', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/raci.service.ts:86:45
       return result.rows as RaciAssignment[];
     });
   } finally {
-    userMetrics.observeDb('raci.getByTeam', Date.now() - start);
+    userMetrics.observeDb('raci.getByTeam', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/raci.service.ts:103:63
 ): Promise<RaciAssignment> {
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      // Verify team belongs to tenant
-      const teamRes = await c.query(
-        `SELECT name FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [data.teamId, tenantId],
-      );
-      if (!teamRes.rows.length) {
-        throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId: data.teamId });
-      }
-
-      const result = await c.query(
-        `INSERT INTO dos.team_raci_assignments
-           (tenant_id, team_id, user_id, scope_type, scope_id, raci_role, assigned_by)
-         VALUES ($1, $2, $3, $4, $5, $6, $7)
-         ON CONFLICT (tenant_id, team_id, user_id, scope_type,
-                      COALESCE(scope_id, '00000000-0000-0000-0000-000000000000'::uuid), raci_role)
-           WHERE revoked_at IS NULL
-         DO UPDATE SET updated_at = NOW()
-         RETURNING id, team_id, user_id, scope_type, scope_id, raci_role, assigned_by, assigned_at`,
-        [tenantId, data.teamId, data.userId, data.scopeType, data.scopeId ?? null, data.raciRole, data.assignedBy],
-      );
-      const inserted = result.rows[0] as RaciAssignment;
-      inserted.team_name = teamRes.rows[0]?.name ?? '';
-      return inserted;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.raciAssigned(tenantId, data.raciRole);
     return row;
killedBy: raci.service assignRaci rejects when team is not in the tenant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/domain/raci.service.ts:109:11
         `SELECT name FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [data.teamId, tenantId],
       );
-      if (!teamRes.rows.length) {
+      if (teamRes.rows.length) {
         throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId: data.teamId });
       }
killedBy: raci.service assignRaci rejects when team is not in the tenant
statusReason: expected TypeError: Cannot set properties of undef… to match object { code: 'TEAM_NOT_FOUND', status: 404 }

[Killed] ConditionalExpression
src/domain/raci.service.ts:109:11
         `SELECT name FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [data.teamId, tenantId],
       );
-      if (!teamRes.rows.length) {
+      if (true) {
         throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId: data.teamId });
       }
killedBy: raci.service assignRaci inserts and returns the row + team_name
statusReason: Team not found

[Survived] LogicalOperator
src/domain/raci.service.ts:122:62
            WHERE revoked_at IS NULL
          DO UPDATE SET updated_at = NOW()
          RETURNING id, team_id, user_id, scope_type, scope_id, raci_role, assigned_by, assigned_at`,
-        [tenantId, data.teamId, data.userId, data.scopeType, data.scopeId ?? null, data.raciRole, data.assignedBy],
+        [tenantId, data.teamId, data.userId, data.scopeType, data.scopeId && null, data.raciRole, data.assignedBy],
       );
       const inserted = result.rows[0] as RaciAssignment;

[Killed] LogicalOperator
src/domain/raci.service.ts:125:28
         [tenantId, data.teamId, data.userId, data.scopeType, data.scopeId ?? null, data.raciRole, data.assignedBy],
       );
       const inserted = result.rows[0] as RaciAssignment;
-      inserted.team_name = teamRes.rows[0]?.name ?? '';
+      inserted.team_name = teamRes.rows[0]?.name && '';
       return inserted;
     });
killedBy: raci.service assignRaci inserts and returns the row + team_name
statusReason: expected '' to be 'Alpha' // Object.is equality

[Survived] OptionalChaining
src/domain/raci.service.ts:125:28
         [tenantId, data.teamId, data.userId, data.scopeType, data.scopeId ?? null, data.raciRole, data.assignedBy],
       );
       const inserted = result.rows[0] as RaciAssignment;
-      inserted.team_name = teamRes.rows[0]?.name ?? '';
+      inserted.team_name = teamRes.rows[0].name ?? '';
       return inserted;
     });

[Survived] BlockStatement
src/domain/raci.service.ts:130:13
     });
     userMetrics.raciAssigned(tenantId, data.raciRole);
     return row;
-  } finally {
-    userMetrics.observeDb('raci.assign', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/raci.service.ts:131:42
     userMetrics.raciAssigned(tenantId, data.raciRole);
     return row;
   } finally {
-    userMetrics.observeDb('raci.assign', Date.now() - start);
+    userMetrics.observeDb('raci.assign', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/raci.service.ts:138:21
 export async function revokeRaci(
   tenantId: string,
   assignmentId: string,
-): Promise<boolean> {
-  const start = Date.now();
-  try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.team_raci_assignments
-         SET revoked_at = NOW(), updated_at = NOW()
-         WHERE id = $1 AND tenant_id = $2 AND revoked_at IS NULL
-         RETURNING id`,
-        [assignmentId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (revoked) userMetrics.raciRevoked(tenantId);
-    return revoked;
-  } finally {
-    userMetrics.observeDb('raci.revoke', Date.now() - start);
-  }
-}
+): Promise<boolean> {}
 
killedBy: raci.service revokeRaci returns true when row is updated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/raci.service.ts:140:7
   assignmentId: string,
 ): Promise<boolean> {
   const start = Date.now();
-  try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.team_raci_assignments
-         SET revoked_at = NOW(), updated_at = NOW()
-         WHERE id = $1 AND tenant_id = $2 AND revoked_at IS NULL
-         RETURNING id`,
-        [assignmentId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (revoked) userMetrics.raciRevoked(tenantId);
-    return revoked;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('raci.revoke', Date.now() - start);
   }
killedBy: raci.service revokeRaci returns true when row is updated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/raci.service.ts:141:67
 ): Promise<boolean> {
   const start = Date.now();
   try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.team_raci_assignments
-         SET revoked_at = NOW(), updated_at = NOW()
-         WHERE id = $1 AND tenant_id = $2 AND revoked_at IS NULL
-         RETURNING id`,
-        [assignmentId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
+    const revoked = await withTenantClient(tenantId, async (c) => {});
     if (revoked) userMetrics.raciRevoked(tenantId);
     return revoked;
killedBy: raci.service revokeRaci returns true when row is updated
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrayDeclaration
src/domain/raci.service.ts:147:9
          SET revoked_at = NOW(), updated_at = NOW()
          WHERE id = $1 AND tenant_id = $2 AND revoked_at IS NULL
          RETURNING id`,
-        [assignmentId, tenantId],
+        [],
       );
       return result.rows.length > 0;
killedBy: raci.service revokeRaci sets revoked_at + updated_at to NOW and filters tenant
statusReason: expected [] to deeply equal [ 'r1', 'tenant-a' ]

[Killed] ConditionalExpression
src/domain/raci.service.ts:149:14
          RETURNING id`,
         [assignmentId, tenantId],
       );
-      return result.rows.length > 0;
+      return false;
     });
     if (revoked) userMetrics.raciRevoked(tenantId);
killedBy: raci.service revokeRaci returns true when row is updated
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/domain/raci.service.ts:149:14
          RETURNING id`,
         [assignmentId, tenantId],
       );
-      return result.rows.length > 0;
+      return result.rows.length <= 0;
     });
     if (revoked) userMetrics.raciRevoked(tenantId);
killedBy: raci.service revokeRaci returns true when row is updated
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/domain/raci.service.ts:151:9
       );
       return result.rows.length > 0;
     });
-    if (revoked) userMetrics.raciRevoked(tenantId);
+    if (true) userMetrics.raciRevoked(tenantId);
     return revoked;
   } finally {

[Survived] ConditionalExpression
src/domain/raci.service.ts:151:9
       );
       return result.rows.length > 0;
     });
-    if (revoked) userMetrics.raciRevoked(tenantId);
+    if (false) userMetrics.raciRevoked(tenantId);
     return revoked;
   } finally {

[Survived] BlockStatement
src/domain/raci.service.ts:153:13
     });
     if (revoked) userMetrics.raciRevoked(tenantId);
     return revoked;
-  } finally {
-    userMetrics.observeDb('raci.revoke', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/raci.service.ts:154:42
     if (revoked) userMetrics.raciRevoked(tenantId);
     return revoked;
   } finally {
-    userMetrics.observeDb('raci.revoke', Date.now() - start);
+    userMetrics.observeDb('raci.revoke', Date.now() + start);
   }
 }
