[Killed] ConditionalExpression
src/domain/team.service.ts:41:16
   tenantId: string,
   options: ListTeamsOptions = {},
 ): Promise<{ data: Team[]; total: number }> {
-  const page = options.page || 1;
+  const page = false;
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;
killedBy: team.service listTeams defaults paging when options empty
statusReason: expected -25 to be +0 // Object.is equality

[Killed] LogicalOperator
src/domain/team.service.ts:41:16
   tenantId: string,
   options: ListTeamsOptions = {},
 ): Promise<{ data: Team[]; total: number }> {
-  const page = options.page || 1;
+  const page = options.page && 1;
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;
killedBy: team.service listTeams defaults paging when options empty
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ConditionalExpression
src/domain/team.service.ts:42:20
   options: ListTeamsOptions = {},
 ): Promise<{ data: Team[]; total: number }> {
   const page = options.page || 1;
-  const pageSize = options.pageSize || 25;
+  const pageSize = true;
   const offset = (page - 1) * pageSize;
 
killedBy: team.service listTeams defaults paging when options empty
statusReason: expected true to be 25 // Object.is equality

[Killed] ConditionalExpression
src/domain/team.service.ts:42:20
   options: ListTeamsOptions = {},
 ): Promise<{ data: Team[]; total: number }> {
   const page = options.page || 1;
-  const pageSize = options.pageSize || 25;
+  const pageSize = false;
   const offset = (page - 1) * pageSize;
 
killedBy: team.service listTeams defaults paging when options empty
statusReason: expected false to be 25 // Object.is equality

[Killed] ArithmeticOperator
src/domain/team.service.ts:43:19
 ): Promise<{ data: Team[]; total: number }> {
   const page = options.page || 1;
   const pageSize = options.pageSize || 25;
-  const offset = (page - 1) * pageSize;
+  const offset = (page + 1) * pageSize;
 
   const params: unknown[] = [tenantId];
killedBy: team.service listTeams defaults paging when options empty
statusReason: expected 50 to be +0 // Object.is equality

[Survived] ArithmeticOperator
src/domain/team.service.ts:43:18
 ): Promise<{ data: Team[]; total: number }> {
   const page = options.page || 1;
   const pageSize = options.pageSize || 25;
-  const offset = (page - 1) * pageSize;
+  const offset = (page - 1) / pageSize;
 
   const params: unknown[] = [tenantId];

[Survived] ArrayDeclaration
src/domain/team.service.ts:45:29
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;
 
-  const params: unknown[] = [tenantId];
+  const params: unknown[] = [];
   const conditions: string[] = ['tenant_id = $1', 'deleted_at IS NULL'];
 

[Killed] StringLiteral
src/domain/team.service.ts:46:33
   const offset = (page - 1) * pageSize;
 
   const params: unknown[] = [tenantId];
-  const conditions: string[] = ['tenant_id = $1', 'deleted_at IS NULL'];
+  const conditions: string[] = ["", 'deleted_at IS NULL'];
 
   if (options.status) {
killedBy: team.service listTeams WHERE includes tenant_id and deleted_at IS NULL
statusReason: expected 'SELECT COUNT(*) AS count FROM dos.tea…' to match /tenant_id = \$1/

[Killed] ArrayDeclaration
src/domain/team.service.ts:46:32
   const offset = (page - 1) * pageSize;
 
   const params: unknown[] = [tenantId];
-  const conditions: string[] = ['tenant_id = $1', 'deleted_at IS NULL'];
+  const conditions: string[] = [];
 
   if (options.status) {
killedBy: team.service listTeams WHERE includes tenant_id and deleted_at IS NULL
statusReason: expected 'SELECT COUNT(*) AS count FROM dos.tea…' to match /tenant_id = \$1/

[Killed] ConditionalExpression
src/domain/team.service.ts:48:7
   const params: unknown[] = [tenantId];
   const conditions: string[] = ['tenant_id = $1', 'deleted_at IS NULL'];
 
-  if (options.status) {
+  if (false) {
     params.push(options.status);
     conditions.push(`status = $${params.length}`);
killedBy: team.service listTeams passes status filter when provided
statusReason: expected 'SELECT COUNT(*) AS count FROM dos.tea…' to match /status = \$/

[Killed] BlockStatement
src/domain/team.service.ts:48:23
   const params: unknown[] = [tenantId];
   const conditions: string[] = ['tenant_id = $1', 'deleted_at IS NULL'];
 
-  if (options.status) {
-    params.push(options.status);
-    conditions.push(`status = $${params.length}`);
-  }
+  if (options.status) {}
 
   const where = `WHERE ${conditions.join(' AND ')}`;
killedBy: team.service listTeams passes status filter when provided
statusReason: expected 'SELECT COUNT(*) AS count FROM dos.tea…' to match /status = \$/

[Survived] StringLiteral
src/domain/team.service.ts:53:42
     conditions.push(`status = $${params.length}`);
   }
 
-  const where = `WHERE ${conditions.join(' AND ')}`;
+  const where = `WHERE ${conditions.join("")}`;
   const start = Date.now();
 

[Killed] BlockStatement
src/domain/team.service.ts:56:73
   const where = `WHERE ${conditions.join(' AND ')}`;
   const start = Date.now();
 
-  const { total, data } = await withTenantClient(tenantId, async (c) => {
-    const countResult = await c.query(`SELECT COUNT(*) AS count FROM dos.teams ${where}`, params);
-    const listParams = [...params, pageSize, offset];
-    const listResult = await c.query(
-      `SELECT ${TEAM_COLS}
-         FROM dos.teams ${where}
-         ORDER BY created_at DESC
-         LIMIT $${listParams.length - 1} OFFSET $${listParams.length}`,
-      listParams,
-    );
-    return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
-      data: listResult.rows as Team[],
-    };
-  });
+  const { total, data } = await withTenantClient(tenantId, async (c) => {});
 
   userMetrics.observeDb('team.list', Date.now() - start);
killedBy: team.service listTeams WHERE includes tenant_id and deleted_at IS NULL
statusReason: Cannot destructure property 'total' of '(intermediate value)' as it is undefined.

[Survived] ArithmeticOperator
src/domain/team.service.ts:63:19
       `SELECT ${TEAM_COLS}
          FROM dos.teams ${where}
          ORDER BY created_at DESC
-         LIMIT $${listParams.length - 1} OFFSET $${listParams.length}`,
+         LIMIT $${listParams.length + 1} OFFSET $${listParams.length}`,
       listParams,
     );

[Survived] ObjectLiteral
src/domain/team.service.ts:66:12
          LIMIT $${listParams.length - 1} OFFSET $${listParams.length}`,
       listParams,
     );
-    return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
-      data: listResult.rows as Team[],
-    };
+    return {};
   });
 

[Survived] LogicalOperator
src/domain/team.service.ts:67:23
       listParams,
     );
     return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
+      total: parseInt(countResult.rows[0]?.count && '0', 10),
       data: listResult.rows as Team[],
     };

[Survived] ConditionalExpression
src/domain/team.service.ts:67:23
       listParams,
     );
     return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
+      total: parseInt(true, 10),
       data: listResult.rows as Team[],
     };

[Survived] ArithmeticOperator
src/domain/team.service.ts:72:38
     };
   });
 
-  userMetrics.observeDb('team.list', Date.now() - start);
+  userMetrics.observeDb('team.list', Date.now() + start);
   return { data, total };
 }

[Killed] BlockStatement
src/domain/team.service.ts:76:91
   return { data, total };
 }
 
-export async function getTeamById(tenantId: string, teamId: string): Promise<Team | null> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${TEAM_COLS}
-           FROM dos.teams
-          WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [teamId, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
-  } finally {
-    userMetrics.observeDb('team.getById', Date.now() - start);
-  }
-}
+export async function getTeamById(tenantId: string, teamId: string): Promise<Team | null> {}
 
 export async function createTeam(
killedBy: team.service getTeamById scopes by team_id + tenant_id + deleted_at
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] BlockStatement
src/domain/team.service.ts:78:7
 
 export async function getTeamById(tenantId: string, teamId: string): Promise<Team | null> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${TEAM_COLS}
-           FROM dos.teams
-          WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [teamId, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.getById', Date.now() - start);
   }
killedBy: team.service getTeamById scopes by team_id + tenant_id + deleted_at
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] BlockStatement
src/domain/team.service.ts:79:58
 export async function getTeamById(tenantId: string, teamId: string): Promise<Team | null> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${TEAM_COLS}
-           FROM dos.teams
-          WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [teamId, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('team.getById', Date.now() - start);
killedBy: team.service getTeamById scopes by team_id + tenant_id + deleted_at
statusReason: Cannot read properties of undefined (reading 'params')

[Killed] StringLiteral
src/domain/team.service.ts:81:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `SELECT ${TEAM_COLS}
-           FROM dos.teams
-          WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
+        ``,
         [teamId, tenantId],
       );
killedBy: team.service getTeamById scopes by team_id + tenant_id + deleted_at
statusReason: expected '' to match /team_id = \$1/

[Killed] ArrayDeclaration
src/domain/team.service.ts:85:9
            FROM dos.teams
           WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
           LIMIT 1`,
-        [teamId, tenantId],
+        [],
       );
       return (result.rows[0] as Team) || null;
killedBy: team.service getTeamById scopes by team_id + tenant_id + deleted_at
statusReason: expected [] to deeply equal [ 't1', 'tenant-a' ]

[Survived] ConditionalExpression
src/domain/team.service.ts:87:14
           LIMIT 1`,
         [teamId, tenantId],
       );
-      return (result.rows[0] as Team) || null;
+      return false;
     });
   } finally {

[Survived] LogicalOperator
src/domain/team.service.ts:87:14
           LIMIT 1`,
         [teamId, tenantId],
       );
-      return (result.rows[0] as Team) || null;
+      return result.rows[0] as Team && null;
     });
   } finally {

[Survived] BlockStatement
src/domain/team.service.ts:89:13
       );
       return (result.rows[0] as Team) || null;
     });
-  } finally {
-    userMetrics.observeDb('team.getById', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:90:43
       return (result.rows[0] as Team) || null;
     });
   } finally {
-    userMetrics.observeDb('team.getById', Date.now() - start);
+    userMetrics.observeDb('team.getById', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:97:18
 export async function createTeam(
   tenantId: string,
   data: { name: string; code?: string; description?: string; department_id?: string; createdBy: string },
-): Promise<Team> {
-  const teamId = randomUUID();
-  const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.teams
-           (team_id, tenant_id, name, code, description, status, department_id, created_by, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, NOW(), NOW())
-         RETURNING ${TEAM_COLS}`,
-        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id ?? null, data.createdBy],
-      );
-      return result.rows[0] as Team;
-    });
-    userMetrics.teamCreated(tenantId);
-    return row;
-  } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
-      throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
-    }
-    throw err;
-  } finally {
-    userMetrics.observeDb('team.create', Date.now() - start);
-  }
-}
+): Promise<Team> {}
 
 export async function updateTeam(
killedBy: team.service createTeam translates unique violation into TEAM_CODE_DUPLICATE
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/team.service.ts:100:7
 ): Promise<Team> {
   const teamId = randomUUID();
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.teams
-           (team_id, tenant_id, name, code, description, status, department_id, created_by, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, NOW(), NOW())
-         RETURNING ${TEAM_COLS}`,
-        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id ?? null, data.createdBy],
-      );
-      return result.rows[0] as Team;
-    });
-    userMetrics.teamCreated(tenantId);
-    return row;
-  } catch (err) {
+  try {} catch (err) {
     if ((err as { code?: string })?.code === '23505') {
       throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
killedBy: team.service createTeam translates unique violation into TEAM_CODE_DUPLICATE
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/team.service.ts:101:63
   const teamId = randomUUID();
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.teams
-           (team_id, tenant_id, name, code, description, status, department_id, created_by, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, NOW(), NOW())
-         RETURNING ${TEAM_COLS}`,
-        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id ?? null, data.createdBy],
-      );
-      return result.rows[0] as Team;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.teamCreated(tenantId);
     return row;
killedBy: team.service createTeam translates unique violation into TEAM_CODE_DUPLICATE
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/domain/team.service.ts:107:84
            (team_id, tenant_id, name, code, description, status, department_id, created_by, created_at, updated_at)
          VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, NOW(), NOW())
          RETURNING ${TEAM_COLS}`,
-        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id ?? null, data.createdBy],
+        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id && null, data.createdBy],
       );
       return result.rows[0] as Team;
killedBy: team.service createTeam handles optional fields as nulls
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/domain/team.service.ts:107:39
            (team_id, tenant_id, name, code, description, status, department_id, created_by, created_at, updated_at)
          VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, NOW(), NOW())
          RETURNING ${TEAM_COLS}`,
-        [teamId, tenantId, data.name, data.code ?? null, data.description ?? null, data.department_id ?? null, data.createdBy],
+        [teamId, tenantId, data.name, data.code && null, data.description ?? null, data.department_id ?? null, data.createdBy],
       );
       return result.rows[0] as Team;
killedBy: team.service createTeam handles optional fields as nulls
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/team.service.ts:113:17
     });
     userMetrics.teamCreated(tenantId);
     return row;
-  } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
-      throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
-    }
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('team.create', Date.now() - start);
   }
killedBy: team.service createTeam translates unique violation into TEAM_CODE_DUPLICATE
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/domain/team.service.ts:114:9
     userMetrics.teamCreated(tenantId);
     return row;
   } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
+    if (true) {
       throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
     }
killedBy: team.service createTeam re-throws non-23505 errors
statusReason: expected [Function] to throw error matching /syntax/ but got 'Team code already in use'

[Killed] ConditionalExpression
src/domain/team.service.ts:114:9
     userMetrics.teamCreated(tenantId);
     return row;
   } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
+    if (false) {
       throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
     }
killedBy: team.service createTeam translates unique violation into TEAM_CODE_DUPLICATE
statusReason: expected Error: dup { code: '23505' } to match object { code: 'TEAM_CODE_DUPLICATE', …(1) }

[Survived] BlockStatement
src/domain/team.service.ts:118:13
       throw new UserServiceError('TEAM_CODE_DUPLICATE', undefined, { code: data.code });
     }
     throw err;
-  } finally {
-    userMetrics.observeDb('team.create', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:119:42
     }
     throw err;
   } finally {
-    userMetrics.observeDb('team.create', Date.now() - start);
+    userMetrics.observeDb('team.create', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:127:25
   tenantId: string,
   teamId: string,
   data: Partial<Pick<Team, 'name' | 'description' | 'status' | 'department_id'>>,
-): Promise<Team | null> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET name = COALESCE($2, name),
-             description = COALESCE($3, description),
-             status = COALESCE($4, status),
-             department_id = COALESCE($5, department_id),
-             updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $6 AND deleted_at IS NULL
-         RETURNING ${TEAM_COLS}`,
-        [teamId, data.name ?? null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
-  } finally {
-    userMetrics.observeDb('team.update', Date.now() - start);
-  }
-}
+): Promise<Team | null> {}
 
 export async function deleteTeam(tenantId: string, teamId: string): Promise<boolean> {
killedBy: team.service updateTeam does not touch rows in other tenants
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/team.service.ts:129:7
   data: Partial<Pick<Team, 'name' | 'description' | 'status' | 'department_id'>>,
 ): Promise<Team | null> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET name = COALESCE($2, name),
-             description = COALESCE($3, description),
-             status = COALESCE($4, status),
-             department_id = COALESCE($5, department_id),
-             updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $6 AND deleted_at IS NULL
-         RETURNING ${TEAM_COLS}`,
-        [teamId, data.name ?? null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.update', Date.now() - start);
   }
killedBy: team.service updateTeam does not touch rows in other tenants
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/team.service.ts:130:58
 ): Promise<Team | null> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET name = COALESCE($2, name),
-             description = COALESCE($3, description),
-             status = COALESCE($4, status),
-             department_id = COALESCE($5, department_id),
-             updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $6 AND deleted_at IS NULL
-         RETURNING ${TEAM_COLS}`,
-        [teamId, data.name ?? null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
-      );
-      return (result.rows[0] as Team) || null;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('team.update', Date.now() - start);
killedBy: team.service updateTeam does not touch rows in other tenants
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/domain/team.service.ts:140:63
              updated_at = NOW()
          WHERE team_id = $1 AND tenant_id = $6 AND deleted_at IS NULL
          RETURNING ${TEAM_COLS}`,
-        [teamId, data.name ?? null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
+        [teamId, data.name ?? null, data.description ?? null, data.status && null, data.department_id ?? null, tenantId],
       );
       return (result.rows[0] as Team) || null;
killedBy: team.service updateTeam handles partial updates with COALESCE fallbacks
statusReason: expected undefined to be null

[Killed] LogicalOperator
src/domain/team.service.ts:140:18
              updated_at = NOW()
          WHERE team_id = $1 AND tenant_id = $6 AND deleted_at IS NULL
          RETURNING ${TEAM_COLS}`,
-        [teamId, data.name ?? null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
+        [teamId, data.name && null, data.description ?? null, data.status ?? null, data.department_id ?? null, tenantId],
       );
       return (result.rows[0] as Team) || null;
killedBy: team.service updateTeam handles partial updates with COALESCE fallbacks
statusReason: expected undefined to be null

[Survived] BlockStatement
src/domain/team.service.ts:144:13
       );
       return (result.rows[0] as Team) || null;
     });
-  } finally {
-    userMetrics.observeDb('team.update', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:145:42
       return (result.rows[0] as Team) || null;
     });
   } finally {
-    userMetrics.observeDb('team.update', Date.now() - start);
+    userMetrics.observeDb('team.update', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:149:86
   }
 }
 
-export async function deleteTeam(tenantId: string, teamId: string): Promise<boolean> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING team_id`,
-        [teamId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-  } finally {
-    userMetrics.observeDb('team.delete', Date.now() - start);
-  }
-}
+export async function deleteTeam(tenantId: string, teamId: string): Promise<boolean> {}
 
 export async function listMembers(tenantId: string, teamId: string): Promise<TeamMember[]> {
killedBy: team.service deleteTeam is soft-delete (UPDATE ... deleted_at)
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/team.service.ts:151:7
 
 export async function deleteTeam(tenantId: string, teamId: string): Promise<boolean> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING team_id`,
-        [teamId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.delete', Date.now() - start);
   }
killedBy: team.service deleteTeam is soft-delete (UPDATE ... deleted_at)
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/team.service.ts:152:58
 export async function deleteTeam(tenantId: string, teamId: string): Promise<boolean> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.teams
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING team_id`,
-        [teamId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('team.delete', Date.now() - start);
killedBy: team.service deleteTeam is soft-delete (UPDATE ... deleted_at)
statusReason: expected undefined to be true // Object.is equality

[Killed] StringLiteral
src/domain/team.service.ts:154:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `UPDATE dos.teams
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING team_id`,
+        ``,
         [teamId, tenantId],
       );
killedBy: team.service deleteTeam is soft-delete (UPDATE ... deleted_at)
statusReason: expected '' to match /UPDATE dos\.teams/

[Survived] BlockStatement
src/domain/team.service.ts:162:13
       );
       return result.rows.length > 0;
     });
-  } finally {
-    userMetrics.observeDb('team.delete', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:163:42
       return result.rows.length > 0;
     });
   } finally {
-    userMetrics.observeDb('team.delete', Date.now() - start);
+    userMetrics.observeDb('team.delete', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:169:7
 
 export async function listMembers(tenantId: string, teamId: string): Promise<TeamMember[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      // Ensure the team itself is in this tenant before joining — defense in
-      // depth alongside RLS + FK.
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) return [];
-
-      const result = await c.query(
-        `SELECT tm.member_id, tm.team_id, tm.user_id, tm.role, tm.joined_at, tm.left_at,
-                u.email, u.display_name, u.first_name, u.last_name
-           FROM dos.team_members tm
-           LEFT JOIN dos.users u ON u.user_id = tm.user_id
-          WHERE tm.team_id = $1 AND tm.left_at IS NULL`,
-        [teamId],
-      );
-      return result.rows as TeamMember[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.listMembers', Date.now() - start);
   }
killedBy: team.service listMembers returns [] when team not in tenant (no leak)
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/domain/team.service.ts:170:58
 export async function listMembers(tenantId: string, teamId: string): Promise<TeamMember[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      // Ensure the team itself is in this tenant before joining — defense in
-      // depth alongside RLS + FK.
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) return [];
-
-      const result = await c.query(
-        `SELECT tm.member_id, tm.team_id, tm.user_id, tm.role, tm.joined_at, tm.left_at,
-                u.email, u.display_name, u.first_name, u.last_name
-           FROM dos.team_members tm
-           LEFT JOIN dos.users u ON u.user_id = tm.user_id
-          WHERE tm.team_id = $1 AND tm.left_at IS NULL`,
-        [teamId],
-      );
-      return result.rows as TeamMember[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('team.listMembers', Date.now() - start);
killedBy: team.service listMembers returns [] when team not in tenant (no leak)
statusReason: expected undefined to deeply equal []
