[Survived] StringLiteral
src/domain/team.service.ts:174:9
       // Ensure the team itself is in this tenant before joining — defense in
       // depth alongside RLS + FK.
       const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
+        ``,
         [teamId, tenantId],
       );

[Survived] BooleanLiteral
src/domain/team.service.ts:177:11
         `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [teamId, tenantId],
       );
-      if (!teamRes.rows.length) return [];
+      if (teamRes.rows.length) return [];
 
       const result = await c.query(

[Survived] ConditionalExpression
src/domain/team.service.ts:177:11
         `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [teamId, tenantId],
       );
-      if (!teamRes.rows.length) return [];
+      if (true) return [];
 
       const result = await c.query(

[Survived] BlockStatement
src/domain/team.service.ts:189:13
       );
       return result.rows as TeamMember[];
     });
-  } finally {
-    userMetrics.observeDb('team.listMembers', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:190:47
       return result.rows as TeamMember[];
     });
   } finally {
-    userMetrics.observeDb('team.listMembers', Date.now() - start);
+    userMetrics.observeDb('team.listMembers', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/team.service.ts:190:27
       return result.rows as TeamMember[];
     });
   } finally {
-    userMetrics.observeDb('team.listMembers', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:201:7
   role: string,
 ): Promise<TeamMember> {
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) {
-        throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId });
-      }
-
-      const result = await c.query(
-        `INSERT INTO dos.team_members (team_id, user_id, role, joined_at)
-         VALUES ($1, $2, $3, NOW())
-         ON CONFLICT (team_id, user_id) DO UPDATE
-           SET role = $3, left_at = NULL, joined_at = NOW()
-         RETURNING member_id, team_id, user_id, role, joined_at, left_at`,
-        [teamId, userId, role || 'member'],
-      );
-      return result.rows[0] as TeamMember;
-    });
-    userMetrics.teamMemberAdded(tenantId);
-    return row;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.addMember', Date.now() - start);
   }
killedBy: team.service addMember rejects when team does not belong to tenant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/team.service.ts:202:63
 ): Promise<TeamMember> {
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) {
-        throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId });
-      }
-
-      const result = await c.query(
-        `INSERT INTO dos.team_members (team_id, user_id, role, joined_at)
-         VALUES ($1, $2, $3, NOW())
-         ON CONFLICT (team_id, user_id) DO UPDATE
-           SET role = $3, left_at = NULL, joined_at = NOW()
-         RETURNING member_id, team_id, user_id, role, joined_at, left_at`,
-        [teamId, userId, role || 'member'],
-      );
-      return result.rows[0] as TeamMember;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.teamMemberAdded(tenantId);
     return row;
killedBy: team.service addMember rejects when team does not belong to tenant
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/domain/team.service.ts:207:11
         `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [teamId, tenantId],
       );
-      if (!teamRes.rows.length) {
+      if (false) {
         throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId });
       }
killedBy: team.service addMember rejects when team does not belong to tenant
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ObjectLiteral
src/domain/team.service.ts:208:65
         [teamId, tenantId],
       );
       if (!teamRes.rows.length) {
-        throw new UserServiceError('TEAM_NOT_FOUND', undefined, { teamId });
+        throw new UserServiceError('TEAM_NOT_FOUND', undefined, {});
       }
 

[Survived] LogicalOperator
src/domain/team.service.ts:217:26
          ON CONFLICT (team_id, user_id) DO UPDATE
            SET role = $3, left_at = NULL, joined_at = NOW()
          RETURNING member_id, team_id, user_id, role, joined_at, left_at`,
-        [teamId, userId, role || 'member'],
+        [teamId, userId, role && 'member'],
       );
       return result.rows[0] as TeamMember;

[Survived] ConditionalExpression
src/domain/team.service.ts:217:26
          ON CONFLICT (team_id, user_id) DO UPDATE
            SET role = $3, left_at = NULL, joined_at = NOW()
          RETURNING member_id, team_id, user_id, role, joined_at, left_at`,
-        [teamId, userId, role || 'member'],
+        [teamId, userId, false],
       );
       return result.rows[0] as TeamMember;

[Survived] BlockStatement
src/domain/team.service.ts:223:13
     });
     userMetrics.teamMemberAdded(tenantId);
     return row;
-  } finally {
-    userMetrics.observeDb('team.addMember', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:224:45
     userMetrics.teamMemberAdded(tenantId);
     return row;
   } finally {
-    userMetrics.observeDb('team.addMember', Date.now() - start);
+    userMetrics.observeDb('team.addMember', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/team.service.ts:228:104
   }
 }
 
-export async function removeMember(tenantId: string, teamId: string, userId: string): Promise<boolean> {
-  const start = Date.now();
-  try {
-    const ok = await withTenantClient(tenantId, async (c) => {
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) return false;
-      const result = await c.query(
-        `UPDATE dos.team_members
-         SET left_at = NOW()
-         WHERE team_id = $1 AND user_id = $2 AND left_at IS NULL
-         RETURNING member_id`,
-        [teamId, userId],
-      );
-      return result.rows.length > 0;
-    });
-    if (ok) userMetrics.teamMemberRemoved(tenantId);
-    return ok;
-  } finally {
-    userMetrics.observeDb('team.removeMember', Date.now() - start);
-  }
-}
+export async function removeMember(tenantId: string, teamId: string, userId: string): Promise<boolean> {}
 
killedBy: team.service removeMember returns false when team not in tenant (no leak)
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/domain/team.service.ts:230:7
 
 export async function removeMember(tenantId: string, teamId: string, userId: string): Promise<boolean> {
   const start = Date.now();
-  try {
-    const ok = await withTenantClient(tenantId, async (c) => {
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) return false;
-      const result = await c.query(
-        `UPDATE dos.team_members
-         SET left_at = NOW()
-         WHERE team_id = $1 AND user_id = $2 AND left_at IS NULL
-         RETURNING member_id`,
-        [teamId, userId],
-      );
-      return result.rows.length > 0;
-    });
-    if (ok) userMetrics.teamMemberRemoved(tenantId);
-    return ok;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('team.removeMember', Date.now() - start);
   }
killedBy: team.service removeMember returns false when team not in tenant (no leak)
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/domain/team.service.ts:231:62
 export async function removeMember(tenantId: string, teamId: string, userId: string): Promise<boolean> {
   const start = Date.now();
   try {
-    const ok = await withTenantClient(tenantId, async (c) => {
-      const teamRes = await c.query(
-        `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
-        [teamId, tenantId],
-      );
-      if (!teamRes.rows.length) return false;
-      const result = await c.query(
-        `UPDATE dos.team_members
-         SET left_at = NOW()
-         WHERE team_id = $1 AND user_id = $2 AND left_at IS NULL
-         RETURNING member_id`,
-        [teamId, userId],
-      );
-      return result.rows.length > 0;
-    });
+    const ok = await withTenantClient(tenantId, async (c) => {});
     if (ok) userMetrics.teamMemberRemoved(tenantId);
     return ok;
killedBy: team.service removeMember returns false when team not in tenant (no leak)
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/domain/team.service.ts:236:40
         `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [teamId, tenantId],
       );
-      if (!teamRes.rows.length) return false;
+      if (!teamRes.rows.length) return true;
       const result = await c.query(
         `UPDATE dos.team_members
killedBy: team.service removeMember returns false when team not in tenant (no leak)
statusReason: expected true to be false // Object.is equality

[Survived] ConditionalExpression
src/domain/team.service.ts:236:11
         `SELECT 1 FROM dos.teams WHERE team_id = $1 AND tenant_id = $2 AND deleted_at IS NULL`,
         [teamId, tenantId],
       );
-      if (!teamRes.rows.length) return false;
+      if (false) return false;
       const result = await c.query(
         `UPDATE dos.team_members

[NoCoverage] StringLiteral
src/domain/team.service.ts:238:9
       );
       if (!teamRes.rows.length) return false;
       const result = await c.query(
-        `UPDATE dos.team_members
-         SET left_at = NOW()
-         WHERE team_id = $1 AND user_id = $2 AND left_at IS NULL
-         RETURNING member_id`,
+        ``,
         [teamId, userId],
       );

[NoCoverage] ArrayDeclaration
src/domain/team.service.ts:242:9
          SET left_at = NOW()
          WHERE team_id = $1 AND user_id = $2 AND left_at IS NULL
          RETURNING member_id`,
-        [teamId, userId],
+        [],
       );
       return result.rows.length > 0;

[NoCoverage] ConditionalExpression
src/domain/team.service.ts:244:14
          RETURNING member_id`,
         [teamId, userId],
       );
-      return result.rows.length > 0;
+      return true;
     });
     if (ok) userMetrics.teamMemberRemoved(tenantId);

[Survived] ConditionalExpression
src/domain/team.service.ts:246:9
       );
       return result.rows.length > 0;
     });
-    if (ok) userMetrics.teamMemberRemoved(tenantId);
+    if (false) userMetrics.teamMemberRemoved(tenantId);
     return ok;
   } finally {

[Survived] ConditionalExpression
src/domain/team.service.ts:246:9
       );
       return result.rows.length > 0;
     });
-    if (ok) userMetrics.teamMemberRemoved(tenantId);
+    if (true) userMetrics.teamMemberRemoved(tenantId);
     return ok;
   } finally {

[Survived] BlockStatement
src/domain/team.service.ts:248:13
     });
     if (ok) userMetrics.teamMemberRemoved(tenantId);
     return ok;
-  } finally {
-    userMetrics.observeDb('team.removeMember', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/team.service.ts:249:48
     if (ok) userMetrics.teamMemberRemoved(tenantId);
     return ok;
   } finally {
-    userMetrics.observeDb('team.removeMember', Date.now() - start);
+    userMetrics.observeDb('team.removeMember', Date.now() + start);
   }
 }
