[Survived] ConditionalExpression
src/domain/user.service.ts:69:16
   tenantId: string,
   options: ListUsersOptions = {},
 ): Promise<{ data: UserProfile[]; total: number }> {
-  const page = options.page || 1;
+  const page = false;
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;

[Survived] LogicalOperator
src/domain/user.service.ts:69:16
   tenantId: string,
   options: ListUsersOptions = {},
 ): Promise<{ data: UserProfile[]; total: number }> {
-  const page = options.page || 1;
+  const page = options.page && 1;
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;

[Survived] LogicalOperator
src/domain/user.service.ts:70:20
   options: ListUsersOptions = {},
 ): Promise<{ data: UserProfile[]; total: number }> {
   const page = options.page || 1;
-  const pageSize = options.pageSize || 25;
+  const pageSize = options.pageSize && 25;
   const offset = (page - 1) * pageSize;
 

[Killed] ArrayDeclaration
src/domain/user.service.ts:73:32
   const pageSize = options.pageSize || 25;
   const offset = (page - 1) * pageSize;
 
-  const conditions: string[] = ['tenant_id = $1'];
+  const conditions: string[] = [];
   const params: unknown[] = [tenantId];
 
killedBy: user.service listUsers never leaks tenant-B data when asked for tenant-A
statusReason: expected 'SELECT COUNT(*) AS count FROM public.…' to match /tenant_id = \$1/

[Killed] BlockStatement
src/domain/user.service.ts:80:21
     params.push(options.status);
     conditions.push(`status = $${params.length}`);
   }
-  if (options.role) {
-    params.push(options.role);
-    conditions.push(`role = $${params.length}`);
-  }
+  if (options.role) {}
 
   const where = `WHERE ${conditions.join(' AND ')}`;
killedBy: user.service listUsers applies status + role filters as additional WHERE clauses
statusReason: expected 'SELECT \n  user_id, email, name, full…' to match /role = \$/

[Killed] ConditionalExpression
src/domain/user.service.ts:80:7
     params.push(options.status);
     conditions.push(`status = $${params.length}`);
   }
-  if (options.role) {
+  if (false) {
     params.push(options.role);
     conditions.push(`role = $${params.length}`);
killedBy: user.service listUsers applies status + role filters as additional WHERE clauses
statusReason: expected 'SELECT \n  user_id, email, name, full…' to match /role = \$/

[Killed] StringLiteral
src/domain/user.service.ts:82:21
   }
   if (options.role) {
     params.push(options.role);
-    conditions.push(`role = $${params.length}`);
+    conditions.push(``);
   }
 
killedBy: user.service listUsers applies status + role filters as additional WHERE clauses
statusReason: expected 'SELECT \n  user_id, email, name, full…' to match /role = \$/

[Killed] BlockStatement
src/domain/user.service.ts:88:73
   const where = `WHERE ${conditions.join(' AND ')}`;
   const start = Date.now();
 
-  const { total, data } = await withTenantClient(tenantId, async (c) => {
-    const countResult = await c.query(
-      `SELECT COUNT(*) AS count FROM ${USERS_TABLE} ${where}`,
-      params,
-    );
-    const listParams = [...params, pageSize, offset];
-    const listResult = await c.query(
-      `SELECT ${USER_COLUMNS}
-         FROM ${USERS_TABLE} ${where}
-         ORDER BY created_at DESC
-         LIMIT $${listParams.length - 1} OFFSET $${listParams.length}`,
-      listParams,
-    );
-    return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
-      data: listResult.rows as UserProfile[],
-    };
-  });
+  const { total, data } = await withTenantClient(tenantId, async (c) => {});
 
   userMetrics.observeDb('user.list', Date.now() - start);
killedBy: user.service listUsers scopes every query to the tenant
statusReason: Cannot destructure property 'total' of '(intermediate value)' as it is undefined.

[Killed] StringLiteral
src/domain/user.service.ts:90:7
 
   const { total, data } = await withTenantClient(tenantId, async (c) => {
     const countResult = await c.query(
-      `SELECT COUNT(*) AS count FROM ${USERS_TABLE} ${where}`,
+      ``,
       params,
     );
killedBy: user.service listUsers scopes every query to the tenant
statusReason: expected +0 to be 2 // Object.is equality

[Killed] StringLiteral
src/domain/user.service.ts:95:7
     );
     const listParams = [...params, pageSize, offset];
     const listResult = await c.query(
-      `SELECT ${USER_COLUMNS}
-         FROM ${USERS_TABLE} ${where}
-         ORDER BY created_at DESC
-         LIMIT $${listParams.length - 1} OFFSET $${listParams.length}`,
+      ``,
       listParams,
     );
killedBy: user.service listUsers applies status + role filters as additional WHERE clauses
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] ConditionalExpression
src/domain/user.service.ts:102:23
       listParams,
     );
     return {
-      total: parseInt(countResult.rows[0]?.count || '0', 10),
+      total: parseInt(false, 10),
       data: listResult.rows as UserProfile[],
     };
killedBy: user.service listUsers scopes every query to the tenant
statusReason: expected NaN to be 2 // Object.is equality

[Survived] ArithmeticOperator
src/domain/user.service.ts:107:38
     };
   });
 
-  userMetrics.observeDb('user.list', Date.now() - start);
+  userMetrics.observeDb('user.list', Date.now() + start);
   return { data, total };
 }

[Killed] ObjectLiteral
src/domain/user.service.ts:108:10
   });
 
   userMetrics.observeDb('user.list', Date.now() - start);
-  return { data, total };
+  return {};
 }
 
killedBy: user.service listUsers scopes every query to the tenant
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
src/domain/user.service.ts:111:98
   return { data, total };
 }
 
-export async function getUserById(tenantId: string, userId: string): Promise<UserProfile | null> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${USER_COLUMNS}
-           FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1)
-            AND tenant_id = $2
-          LIMIT 1`,
-        [userId, tenantId],
-      );
-      return (result.rows[0] as UserProfile) || null;
-    });
-  } finally {
-    userMetrics.observeDb('user.getById', Date.now() - start);
-  }
-}
+export async function getUserById(tenantId: string, userId: string): Promise<UserProfile | null> {}
 
 export async function createUser(tenantId: string, input: CreateUserInput): Promise<UserProfile> {
killedBy: user.service getUserById returns null when no row
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/user.service.ts:113:7
 
 export async function getUserById(tenantId: string, userId: string): Promise<UserProfile | null> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${USER_COLUMNS}
-           FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1)
-            AND tenant_id = $2
-          LIMIT 1`,
-        [userId, tenantId],
-      );
-      return (result.rows[0] as UserProfile) || null;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('user.getById', Date.now() - start);
   }
killedBy: user.service getUserById returns null when no row
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/user.service.ts:114:58
 export async function getUserById(tenantId: string, userId: string): Promise<UserProfile | null> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT ${USER_COLUMNS}
-           FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1)
-            AND tenant_id = $2
-          LIMIT 1`,
-        [userId, tenantId],
-      );
-      return (result.rows[0] as UserProfile) || null;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('user.getById', Date.now() - start);
killedBy: user.service getUserById returns null when no row
statusReason: expected undefined to be null

[Killed] StringLiteral
src/domain/user.service.ts:116:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `SELECT ${USER_COLUMNS}
-           FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1)
-            AND tenant_id = $2
-          LIMIT 1`,
+        ``,
         [userId, tenantId],
       );
killedBy: user.service getUserById enforces tenant_id match in the WHERE clause
statusReason: expected '' to match /tenant_id = \$2/

[Killed] ArrayDeclaration
src/domain/user.service.ts:121:9
           WHERE (user_id = $1 OR email = $1)
             AND tenant_id = $2
           LIMIT 1`,
-        [userId, tenantId],
+        [],
       );
       return (result.rows[0] as UserProfile) || null;
killedBy: user.service getUserById enforces tenant_id match in the WHERE clause
statusReason: expected [] to deeply equal [ 'shared-id', 'tenant-b' ]

[Killed] LogicalOperator
src/domain/user.service.ts:123:14
           LIMIT 1`,
         [userId, tenantId],
       );
-      return (result.rows[0] as UserProfile) || null;
+      return result.rows[0] as UserProfile && null;
     });
   } finally {
killedBy: user.service getUserById returns null when no row
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/domain/user.service.ts:123:14
           LIMIT 1`,
         [userId, tenantId],
       );
-      return (result.rows[0] as UserProfile) || null;
+      return true;
     });
   } finally {
killedBy: user.service getUserById returns null when no row
statusReason: expected true to be null

[Survived] BlockStatement
src/domain/user.service.ts:125:13
       );
       return (result.rows[0] as UserProfile) || null;
     });
-  } finally {
-    userMetrics.observeDb('user.getById', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/user.service.ts:126:43
       return (result.rows[0] as UserProfile) || null;
     });
   } finally {
-    userMetrics.observeDb('user.getById', Date.now() - start);
+    userMetrics.observeDb('user.getById', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/user.service.ts:126:27
       return (result.rows[0] as UserProfile) || null;
     });
   } finally {
-    userMetrics.observeDb('user.getById', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Survived] ConditionalExpression
src/domain/user.service.ts:132:16
 
 export async function createUser(tenantId: string, input: CreateUserInput): Promise<UserProfile> {
   const userId = randomUUID();
-  const role = input.role || 'member';
+  const role = false;
   const displayName = input.display_name || input.name || input.first_name || input.email.split('@')[0];
   const start = Date.now();

[Survived] LogicalOperator
src/domain/user.service.ts:132:16
 
 export async function createUser(tenantId: string, input: CreateUserInput): Promise<UserProfile> {
   const userId = randomUUID();
-  const role = input.role || 'member';
+  const role = input.role && 'member';
   const displayName = input.display_name || input.name || input.first_name || input.email.split('@')[0];
   const start = Date.now();

[Killed] LogicalOperator
src/domain/user.service.ts:133:23
 export async function createUser(tenantId: string, input: CreateUserInput): Promise<UserProfile> {
   const userId = randomUUID();
   const role = input.role || 'member';
-  const displayName = input.display_name || input.name || input.first_name || input.email.split('@')[0];
+  const displayName = (input.display_name || input.name || input.first_name) && input.email.split('@')[0];
   const start = Date.now();
 
killedBy: user.service createUser falls back to email local-part when no display name given
statusReason: expected undefined to be 'alice' // Object.is equality

[Killed] ConditionalExpression
src/domain/user.service.ts:133:23
 export async function createUser(tenantId: string, input: CreateUserInput): Promise<UserProfile> {
   const userId = randomUUID();
   const role = input.role || 'member';
-  const displayName = input.display_name || input.name || input.first_name || input.email.split('@')[0];
+  const displayName = true;
   const start = Date.now();
 
killedBy: user.service createUser falls back to email local-part when no display name given
statusReason: expected true to be 'alice' // Object.is equality

[Killed] BlockStatement
src/domain/user.service.ts:137:63
   const start = Date.now();
 
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO ${USERS_TABLE}
-           (user_id, email, name, full_name, role, status, tenant_id,
-            department_id, language, job_title, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, 'active', $6, $7, $8, $9, NOW(), NOW())
-         RETURNING ${USER_COLUMNS}`,
-        [
-          userId,
-          input.email,
-          displayName,
-          input.first_name && input.last_name ? `${input.first_name} ${input.last_name}` : displayName,
-          role,
-          tenantId,
-          input.department_id ?? null,
-          input.locale ?? null,
-          input.job_title ?? null,
-        ],
-      );
-      return result.rows[0] as UserProfile;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.userCreated(tenantId);
     logger.info('[UserService] User created', { userId, tenantId, email: input.email });
killedBy: user.service createUser inserts with the given tenant_id and returns the row
statusReason: Cannot read properties of undefined (reading 'user_id')

[Killed] ConditionalExpression
src/domain/user.service.ts:148:11
           userId,
           input.email,
           displayName,
-          input.first_name && input.last_name ? `${input.first_name} ${input.last_name}` : displayName,
+          false ? `${input.first_name} ${input.last_name}` : displayName,
           role,
           tenantId,
killedBy: user.service createUser uses first+last full name when both present
statusReason: expected 'First' to be 'First Last' // Object.is equality

[Survived] LogicalOperator
src/domain/user.service.ts:148:11
           userId,
           input.email,
           displayName,
-          input.first_name && input.last_name ? `${input.first_name} ${input.last_name}` : displayName,
+          input.first_name || input.last_name ? `${input.first_name} ${input.last_name}` : displayName,
           role,
           tenantId,

[Survived] LogicalOperator
src/domain/user.service.ts:151:11
           input.first_name && input.last_name ? `${input.first_name} ${input.last_name}` : displayName,
           role,
           tenantId,
-          input.department_id ?? null,
+          input.department_id && null,
           input.locale ?? null,
           input.job_title ?? null,

[Survived] LogicalOperator
src/domain/user.service.ts:152:11
           role,
           tenantId,
           input.department_id ?? null,
-          input.locale ?? null,
+          input.locale && null,
           input.job_title ?? null,
         ],

[Survived] LogicalOperator
src/domain/user.service.ts:153:11
           tenantId,
           input.department_id ?? null,
           input.locale ?? null,
-          input.job_title ?? null,
+          input.job_title && null,
         ],
       );

[Killed] BlockStatement
src/domain/user.service.ts:161:17
     userMetrics.userCreated(tenantId);
     logger.info('[UserService] User created', { userId, tenantId, email: input.email });
     return row;
-  } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
-      throw new UserServiceError('USER_EMAIL_DUPLICATE', undefined, { email: input.email });
-    }
-    logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('user.create', Date.now() - start);
   }
killedBy: user.service createUser translates Postgres unique-violation (23505) into USER_EMAIL_DUPLICATE
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/user.service.ts:162:55
     logger.info('[UserService] User created', { userId, tenantId, email: input.email });
     return row;
   } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
-      throw new UserServiceError('USER_EMAIL_DUPLICATE', undefined, { email: input.email });
-    }
+    if ((err as { code?: string })?.code === '23505') {}
     logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
     throw err;
killedBy: user.service createUser translates Postgres unique-violation (23505) into USER_EMAIL_DUPLICATE
statusReason: expected Error: duplicate key { code: '23505' } to match object { name: 'UserServiceError', …(2) }

[Killed] EqualityOperator
src/domain/user.service.ts:162:9
     logger.info('[UserService] User created', { userId, tenantId, email: input.email });
     return row;
   } catch (err) {
-    if ((err as { code?: string })?.code === '23505') {
+    if ((err as {
+  code?: string;
+})?.code !== '23505') {
       throw new UserServiceError('USER_EMAIL_DUPLICATE', undefined, { email: input.email });
     }
killedBy: user.service createUser translates Postgres unique-violation (23505) into USER_EMAIL_DUPLICATE
statusReason: expected Error: duplicate key { code: '23505' } to match object { name: 'UserServiceError', …(2) }

[Survived] StringLiteral
src/domain/user.service.ts:165:18
     if ((err as { code?: string })?.code === '23505') {
       throw new UserServiceError('USER_EMAIL_DUPLICATE', undefined, { email: input.email });
     }
-    logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
+    logger.error("", { tenantId, email: input.email, error: toErrorMessage(err) });
     throw err;
   } finally {

[Survived] ObjectLiteral
src/domain/user.service.ts:165:57
     if ((err as { code?: string })?.code === '23505') {
       throw new UserServiceError('USER_EMAIL_DUPLICATE', undefined, { email: input.email });
     }
-    logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
+    logger.error('[UserService] Failed to create user', {});
     throw err;
   } finally {

[Survived] BlockStatement
src/domain/user.service.ts:167:13
     }
     logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
     throw err;
-  } finally {
-    userMetrics.observeDb('user.create', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/user.service.ts:168:42
     logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('user.create', Date.now() - start);
+    userMetrics.observeDb('user.create', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/user.service.ts:168:27
     logger.error('[UserService] Failed to create user', { tenantId, email: input.email, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('user.create', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Survived] ArrayDeclaration
src/domain/user.service.ts:183:9
       const existingRes = await c.query(
         `SELECT ${USER_COLUMNS} FROM ${USERS_TABLE}
           WHERE (user_id = $1 OR email = $1) AND tenant_id = $2 LIMIT 1`,
-        [userId, tenantId],
+        [],
       );
       const existing = existingRes.rows[0] as UserProfile | undefined;

[Killed] BooleanLiteral
src/domain/user.service.ts:186:11
         [userId, tenantId],
       );
       const existing = existingRes.rows[0] as UserProfile | undefined;
-      if (!existing) return null;
+      if (existing) return null;
 
       const result = await c.query(
killedBy: user.service updateUser returns null when target does not exist in this tenant
statusReason: Cannot read properties of undefined (reading 'user_id')

[Killed] ConditionalExpression
src/domain/user.service.ts:186:11
         [userId, tenantId],
       );
       const existing = existingRes.rows[0] as UserProfile | undefined;
-      if (!existing) return null;
+      if (true) return null;
 
       const result = await c.query(
killedBy: user.service updateUser passes COALESCE params in the right positions
statusReason: expected undefined to be 'u1' // Object.is equality

[Killed] LogicalOperator
src/domain/user.service.ts:202:11
          RETURNING ${USER_COLUMNS}`,
         [
           existing.user_id,
-          data.name ?? null,
+          data.name && null,
           data.full_name ?? null,
           data.language ?? null,
killedBy: user.service updateUser passes COALESCE params in the right positions
statusReason: expected null to be 'New' // Object.is equality

[Killed] LogicalOperator
src/domain/user.service.ts:203:11
         [
           existing.user_id,
           data.name ?? null,
-          data.full_name ?? null,
+          data.full_name && null,
           data.language ?? null,
           data.department_id ?? null,
killedBy: user.service updateUser passes all fields through COALESCE
statusReason: expected [ 'N', null, 'ar', 'd1', …(3) ] to deeply equal [ 'N', 'F L', 'ar', 'd1', …(3) ]

[Killed] LogicalOperator
src/domain/user.service.ts:204:11
           existing.user_id,
           data.name ?? null,
           data.full_name ?? null,
-          data.language ?? null,
+          data.language && null,
           data.department_id ?? null,
           data.status ?? null,
killedBy: user.service updateUser passes all fields through COALESCE
statusReason: expected [ 'N', 'F L', null, 'd1', …(3) ] to deeply equal [ 'N', 'F L', 'ar', 'd1', …(3) ]

[Killed] LogicalOperator
src/domain/user.service.ts:205:11
           data.name ?? null,
           data.full_name ?? null,
           data.language ?? null,
-          data.department_id ?? null,
+          data.department_id && null,
           data.status ?? null,
           data.role ?? null,
killedBy: user.service updateUser passes all fields through COALESCE
statusReason: expected [ 'N', 'F L', 'ar', null, …(3) ] to deeply equal [ 'N', 'F L', 'ar', 'd1', …(3) ]

[Killed] LogicalOperator
src/domain/user.service.ts:206:11
           data.full_name ?? null,
           data.language ?? null,
           data.department_id ?? null,
-          data.status ?? null,
+          data.status && null,
           data.role ?? null,
           data.job_title ?? null,
killedBy: user.service updateUser passes COALESCE params in the right positions
statusReason: expected null to be 'active' // Object.is equality

[Killed] LogicalOperator
src/domain/user.service.ts:207:11
           data.language ?? null,
           data.department_id ?? null,
           data.status ?? null,
-          data.role ?? null,
+          data.role && null,
           data.job_title ?? null,
           tenantId,
killedBy: user.service updateUser passes all fields through COALESCE
statusReason: expected [ 'N', 'F L', 'ar', 'd1', …(3) ] to deeply equal [ 'N', 'F L', 'ar', 'd1', …(3) ]

[Killed] LogicalOperator
src/domain/user.service.ts:208:11
           data.department_id ?? null,
           data.status ?? null,
           data.role ?? null,
-          data.job_title ?? null,
+          data.job_title && null,
           tenantId,
         ],
killedBy: user.service updateUser passes all fields through COALESCE
statusReason: expected [ 'N', 'F L', 'ar', 'd1', …(3) ] to deeply equal [ 'N', 'F L', 'ar', 'd1', …(3) ]

[Survived] ConditionalExpression
src/domain/user.service.ts:212:14
           tenantId,
         ],
       );
-      return (result.rows[0] as UserProfile) || null;
+      return false;
     });
   } finally {

[Survived] BlockStatement
src/domain/user.service.ts:214:13
       );
       return (result.rows[0] as UserProfile) || null;
     });
-  } finally {
-    userMetrics.userUpdated(tenantId);
-    userMetrics.observeDb('user.update', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/user.service.ts:216:42
     });
   } finally {
     userMetrics.userUpdated(tenantId);
-    userMetrics.observeDb('user.update', Date.now() - start);
+    userMetrics.observeDb('user.update', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/user.service.ts:222:7
 
 export async function deactivateUser(tenantId: string, userId: string): Promise<UserProfile | null> {
   const start = Date.now();
-  try {
-    const updated = await withTenantClient(tenantId, async (c) => {
-      const existingRes = await c.query(
-        `SELECT user_id FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1) AND tenant_id = $2 LIMIT 1`,
-        [userId, tenantId],
-      );
-      const existing = existingRes.rows[0] as { user_id: string } | undefined;
-      if (!existing) return null;
-
-      const result = await c.query(
-        `UPDATE ${USERS_TABLE}
-         SET status = 'inactive', updated_at = NOW()
-         WHERE user_id = $1 AND tenant_id = $2 AND status != 'inactive'
-         RETURNING ${USER_COLUMNS}`,
-        [existing.user_id, tenantId],
-      );
-      return (result.rows[0] as UserProfile) || null;
-    });
-    if (updated) userMetrics.userDeactivated(tenantId);
-    logger.info('[UserService] User deactivated', { userId, tenantId });
-    return updated;
-  } catch (err) {
+  try {} catch (err) {
     logger.error('[UserService] Failed to deactivate user', { userId, tenantId, error: toErrorMessage(err) });
     throw err;
killedBy: user.service deactivateUser sets status=inactive and returns the row
statusReason: expected undefined to be 'inactive' // Object.is equality

[Killed] BlockStatement
src/domain/user.service.ts:223:67
 export async function deactivateUser(tenantId: string, userId: string): Promise<UserProfile | null> {
   const start = Date.now();
   try {
-    const updated = await withTenantClient(tenantId, async (c) => {
-      const existingRes = await c.query(
-        `SELECT user_id FROM ${USERS_TABLE}
-          WHERE (user_id = $1 OR email = $1) AND tenant_id = $2 LIMIT 1`,
-        [userId, tenantId],
-      );
-      const existing = existingRes.rows[0] as { user_id: string } | undefined;
-      if (!existing) return null;
-
-      const result = await c.query(
-        `UPDATE ${USERS_TABLE}
-         SET status = 'inactive', updated_at = NOW()
-         WHERE user_id = $1 AND tenant_id = $2 AND status != 'inactive'
-         RETURNING ${USER_COLUMNS}`,
-        [existing.user_id, tenantId],
-      );
-      return (result.rows[0] as UserProfile) || null;
-    });
+    const updated = await withTenantClient(tenantId, async (c) => {});
     if (updated) userMetrics.userDeactivated(tenantId);
     logger.info('[UserService] User deactivated', { userId, tenantId });
killedBy: user.service deactivateUser sets status=inactive and returns the row
statusReason: expected undefined to be 'inactive' // Object.is equality

[Killed] BooleanLiteral
src/domain/user.service.ts:230:11
         [userId, tenantId],
       );
       const existing = existingRes.rows[0] as { user_id: string } | undefined;
-      if (!existing) return null;
+      if (existing) return null;
 
       const result = await c.query(
killedBy: user.service deactivateUser sets status=inactive and returns the row
statusReason: expected undefined to be 'inactive' // Object.is equality

[Killed] ConditionalExpression
src/domain/user.service.ts:230:11
         [userId, tenantId],
       );
       const existing = existingRes.rows[0] as { user_id: string } | undefined;
-      if (!existing) return null;
+      if (false) return null;
 
       const result = await c.query(
killedBy: user.service deactivateUser returns null when user is not found
statusReason: Cannot read properties of undefined (reading 'user_id')

[Survived] StringLiteral
src/domain/user.service.ts:233:9
       if (!existing) return null;
 
       const result = await c.query(
-        `UPDATE ${USERS_TABLE}
-         SET status = 'inactive', updated_at = NOW()
-         WHERE user_id = $1 AND tenant_id = $2 AND status != 'inactive'
-         RETURNING ${USER_COLUMNS}`,
+        ``,
         [existing.user_id, tenantId],
       );

[Survived] ConditionalExpression
src/domain/user.service.ts:241:9
       );
       return (result.rows[0] as UserProfile) || null;
     });
-    if (updated) userMetrics.userDeactivated(tenantId);
+    if (false) userMetrics.userDeactivated(tenantId);
     logger.info('[UserService] User deactivated', { userId, tenantId });
     return updated;

[Survived] ConditionalExpression
src/domain/user.service.ts:241:9
       );
       return (result.rows[0] as UserProfile) || null;
     });
-    if (updated) userMetrics.userDeactivated(tenantId);
+    if (true) userMetrics.userDeactivated(tenantId);
     logger.info('[UserService] User deactivated', { userId, tenantId });
     return updated;

[Survived] ObjectLiteral
src/domain/user.service.ts:242:51
       return (result.rows[0] as UserProfile) || null;
     });
     if (updated) userMetrics.userDeactivated(tenantId);
-    logger.info('[UserService] User deactivated', { userId, tenantId });
+    logger.info('[UserService] User deactivated', {});
     return updated;
   } catch (err) {
