[Killed] BlockStatement
src/domain/user.service.ts:244:17
     if (updated) userMetrics.userDeactivated(tenantId);
     logger.info('[UserService] User deactivated', { userId, tenantId });
     return updated;
-  } catch (err) {
-    logger.error('[UserService] Failed to deactivate user', { userId, tenantId, error: toErrorMessage(err) });
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('user.deactivate', Date.now() - start);
   }
killedBy: user.service deactivateUser re-throws on DB error
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/domain/user.service.ts:245:18
     logger.info('[UserService] User deactivated', { userId, tenantId });
     return updated;
   } catch (err) {
-    logger.error('[UserService] Failed to deactivate user', { userId, tenantId, error: toErrorMessage(err) });
+    logger.error("", { userId, tenantId, error: toErrorMessage(err) });
     throw err;
   } finally {

[Survived] BlockStatement
src/domain/user.service.ts:247:13
   } catch (err) {
     logger.error('[UserService] Failed to deactivate user', { userId, tenantId, error: toErrorMessage(err) });
     throw err;
-  } finally {
-    userMetrics.observeDb('user.deactivate', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/user.service.ts:248:46
     logger.error('[UserService] Failed to deactivate user', { userId, tenantId, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('user.deactivate', Date.now() - start);
+    userMetrics.observeDb('user.deactivate', Date.now() + start);
   }
 }
