[Killed] BlockStatement
src/middleware/ownership.ts:11:48
 
 const ADMIN_ROLES = new Set(['admin', 'user_admin', 'super_admin']);
 
-function actorRoles(req: Request): Set<string> {
-  const u = req.user as { role?: string; roles?: string[] } | undefined;
-  const out = new Set<string>();
-  if (u?.role) out.add(u.role);
-  for (const r of u?.roles ?? []) out.add(r);
-  return out;
-}
+function actorRoles(req: Request): Set<string> {}
 
 export function hasAdminRole(req: Request): boolean {
killedBy: department routes POST creates new record with valid body
statusReason: expected 500 to be 201 // Object.is equality

[Killed] ConditionalExpression
src/middleware/ownership.ts:14:7
 function actorRoles(req: Request): Set<string> {
   const u = req.user as { role?: string; roles?: string[] } | undefined;
   const out = new Set<string>();
-  if (u?.role) out.add(u.role);
+  if (true) out.add(u.role);
   for (const r of u?.roles ?? []) out.add(r);
   return out;
killedBy: ownership middleware hasAdminRole false for viewer / member
statusReason: Cannot read properties of undefined (reading 'role')

[Killed] ConditionalExpression
src/middleware/ownership.ts:14:7
 function actorRoles(req: Request): Set<string> {
   const u = req.user as { role?: string; roles?: string[] } | undefined;
   const out = new Set<string>();
-  if (u?.role) out.add(u.role);
+  if (false) out.add(u.role);
   for (const r of u?.roles ?? []) out.add(r);
   return out;
killedBy: ownership middleware hasAdminRole true for admin / user_admin / super_admin
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/middleware/ownership.ts:15:19
   const u = req.user as { role?: string; roles?: string[] } | undefined;
   const out = new Set<string>();
   if (u?.role) out.add(u.role);
-  for (const r of u?.roles ?? []) out.add(r);
+  for (const r of u.roles ?? []) out.add(r);
   return out;
 }
killedBy: ownership middleware hasAdminRole false for viewer / member
statusReason: Cannot read properties of undefined (reading 'roles')

[Killed] LogicalOperator
src/middleware/ownership.ts:15:19
   const u = req.user as { role?: string; roles?: string[] } | undefined;
   const out = new Set<string>();
   if (u?.role) out.add(u.role);
-  for (const r of u?.roles ?? []) out.add(r);
+  for (const r of u?.roles && []) out.add(r);
   return out;
 }
killedBy: ownership middleware hasAdminRole true for admin / user_admin / super_admin
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/middleware/ownership.ts:19:53
   return out;
 }
 
-export function hasAdminRole(req: Request): boolean {
-  const roles = actorRoles(req);
-  for (const r of ADMIN_ROLES) if (roles.has(r)) return true;
-  return false;
-}
+export function hasAdminRole(req: Request): boolean {}
 
 /**
killedBy: ownership middleware hasAdminRole true for admin / user_admin / super_admin
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
src/middleware/ownership.ts:21:57
 
 export function hasAdminRole(req: Request): boolean {
   const roles = actorRoles(req);
-  for (const r of ADMIN_ROLES) if (roles.has(r)) return true;
+  for (const r of ADMIN_ROLES) if (roles.has(r)) return false;
   return false;
 }
killedBy: ownership middleware hasAdminRole true for admin / user_admin / super_admin
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/middleware/ownership.ts:21:36
 
 export function hasAdminRole(req: Request): boolean {
   const roles = actorRoles(req);
-  for (const r of ADMIN_ROLES) if (roles.has(r)) return true;
+  for (const r of ADMIN_ROLES) if (true) return true;
   return false;
 }
killedBy: ownership middleware hasAdminRole false for viewer / member
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/middleware/ownership.ts:22:10
 export function hasAdminRole(req: Request): boolean {
   const roles = actorRoles(req);
   for (const r of ADMIN_ROLES) if (roles.has(r)) return true;
-  return false;
+  return true;
 }
 
killedBy: ownership middleware hasAdminRole false for viewer / member
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/middleware/ownership.ts:29:62
  * Applied to routes of shape /users/:id/... — allows if param id === current
  * user id OR current user has admin role.
  */
-export function requireSelfOrAdmin(paramName: string = 'id') {
-  return (req: Request, res: Response, next: NextFunction) => {
-    const targetId = req.params[paramName];
-    const actorId = req.user?.userId;
-    if (targetId && actorId && targetId === actorId) return next();
-    if (hasAdminRole(req)) return next();
-    next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
-      target: targetId, actor: actorId,
-    }));
-  };
-}
+export function requireSelfOrAdmin(paramName: string = 'id') {}
 
 export function requireAdmin() {
killedBy: ownership middleware requireSelfOrAdmin allows user touching own profile
statusReason: requireSelfOrAdmin(...) is not a function

[Killed] BlockStatement
src/middleware/ownership.ts:30:63
  * user id OR current user has admin role.
  */
 export function requireSelfOrAdmin(paramName: string = 'id') {
-  return (req: Request, res: Response, next: NextFunction) => {
-    const targetId = req.params[paramName];
-    const actorId = req.user?.userId;
-    if (targetId && actorId && targetId === actorId) return next();
-    if (hasAdminRole(req)) return next();
-    next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
-      target: targetId, actor: actorId,
-    }));
-  };
+  return (req: Request, res: Response, next: NextFunction) => {};
 }
 
killedBy: ownership middleware requireSelfOrAdmin allows user touching own profile
statusReason: expected "spy" to be called with arguments: []

Received: 



Number of calls: 0

[Killed] OptionalChaining
src/middleware/ownership.ts:32:21
 export function requireSelfOrAdmin(paramName: string = 'id') {
   return (req: Request, res: Response, next: NextFunction) => {
     const targetId = req.params[paramName];
-    const actorId = req.user?.userId;
+    const actorId = req.user.userId;
     if (targetId && actorId && targetId === actorId) return next();
     if (hasAdminRole(req)) return next();
killedBy: ownership middleware requireSelfOrAdmin denies when no actor or target
statusReason: Cannot read properties of undefined (reading 'userId')

[Killed] LogicalOperator
src/middleware/ownership.ts:33:9
   return (req: Request, res: Response, next: NextFunction) => {
     const targetId = req.params[paramName];
     const actorId = req.user?.userId;
-    if (targetId && actorId && targetId === actorId) return next();
+    if (targetId && actorId || targetId === actorId) return next();
     if (hasAdminRole(req)) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
killedBy: user.routes PUT /:id denies non-admin updating someone else
statusReason: expected 200 to be 403 // Object.is equality

[Killed] EqualityOperator
src/middleware/ownership.ts:33:32
   return (req: Request, res: Response, next: NextFunction) => {
     const targetId = req.params[paramName];
     const actorId = req.user?.userId;
-    if (targetId && actorId && targetId === actorId) return next();
+    if (targetId && actorId && targetId !== actorId) return next();
     if (hasAdminRole(req)) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
killedBy: ownership middleware requireSelfOrAdmin allows user touching own profile
statusReason: expected "spy" to be called with arguments: []

Received: 

  1st spy call:

- Array []
+ Array [

[Killed] ConditionalExpression
src/middleware/ownership.ts:34:9
     const targetId = req.params[paramName];
     const actorId = req.user?.userId;
     if (targetId && actorId && targetId === actorId) return next();
-    if (hasAdminRole(req)) return next();
+    if (false) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
       target: targetId, actor: actorId,
killedBy: ownership middleware requireSelfOrAdmin allows admin touching another profile
statusReason: expected "spy" to be called with arguments: []

Received: 

  1st spy call:

- Array []
+ Array [

[Killed] ConditionalExpression
src/middleware/ownership.ts:34:9
     const targetId = req.params[paramName];
     const actorId = req.user?.userId;
     if (targetId && actorId && targetId === actorId) return next();
-    if (hasAdminRole(req)) return next();
+    if (true) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
       target: targetId, actor: actorId,
killedBy: user.routes PUT /:id denies non-admin updating someone else
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BlockStatement
src/middleware/ownership.ts:41:32
   };
 }
 
-export function requireAdmin() {
-  return (req: Request, _res: Response, next: NextFunction) => {
-    if (hasAdminRole(req)) return next();
-    next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
-      actor: req.user?.userId, reason: 'admin_required',
-    }));
-  };
-}
+export function requireAdmin() {}
 
killedBy: ownership middleware requireAdmin denies non-admin with UserServiceError
statusReason: requireAdmin(...) is not a function

[Killed] BlockStatement
src/middleware/ownership.ts:42:64
 }
 
 export function requireAdmin() {
-  return (req: Request, _res: Response, next: NextFunction) => {
-    if (hasAdminRole(req)) return next();
-    next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
-      actor: req.user?.userId, reason: 'admin_required',
-    }));
-  };
+  return (req: Request, _res: Response, next: NextFunction) => {};
 }
 
killedBy: user.routes POST / creates user with valid Zod payload
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/middleware/ownership.ts:43:9
 
 export function requireAdmin() {
   return (req: Request, _res: Response, next: NextFunction) => {
-    if (hasAdminRole(req)) return next();
+    if (true) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
       actor: req.user?.userId, reason: 'admin_required',
killedBy: user.routes POST / denies non-admin
statusReason: expected 201 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/middleware/ownership.ts:43:9
 
 export function requireAdmin() {
   return (req: Request, _res: Response, next: NextFunction) => {
-    if (hasAdminRole(req)) return next();
+    if (false) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
       actor: req.user?.userId, reason: 'admin_required',
killedBy: ownership middleware requireAdmin passes admin through
statusReason: expected "spy" to be called with arguments: []

Received: 

  1st spy call:

- Array []
+ Array [

[Killed] OptionalChaining
src/middleware/ownership.ts:45:14
   return (req: Request, _res: Response, next: NextFunction) => {
     if (hasAdminRole(req)) return next();
     next(new UserServiceError('UNAUTHORIZED_PROFILE_UPDATE', undefined, {
-      actor: req.user?.userId, reason: 'admin_required',
+      actor: req.user.userId, reason: 'admin_required',
     }));
   };
killedBy: ownership middleware requireAdmin denied error when req.user undefined includes actor=undefined
statusReason: Cannot read properties of undefined (reading 'userId')
