[Killed] BlockStatement
src/domain/contracts/user-errors.ts:60:94
   public readonly correlationId: string;
   public readonly timestamp: string;
 
-  constructor(code: UserErrorCode, correlationId?: string, detail?: Record<string, unknown>) {
-    const entry = USER_ERRORS[code];
-    super(entry.message);
-    this.name = 'UserServiceError';
-    this.code = code;
-    this.status = entry.status;
-    this.detail = detail;
-    this.correlationId = correlationId ?? randomUUID();
-    this.timestamp = new Date().toISOString();
-  }
+  constructor(code: UserErrorCode, correlationId?: string, detail?: Record<string, unknown>) {}
 
   toJSON(): UserErrorBody {
killedBy: user.service createUser translates Postgres unique-violation (23505) into USER_EMAIL_DUPLICATE
statusReason: expected ReferenceError: Must call super construct… to match object { name: 'UserServiceError', …(2) }

[Killed] LogicalOperator
src/domain/contracts/user-errors.ts:67:26
     this.code = code;
     this.status = entry.status;
     this.detail = detail;
-    this.correlationId = correlationId ?? randomUUID();
+    this.correlationId = correlationId && randomUUID();
     this.timestamp = new Date().toISOString();
   }
killedBy: user.service UserServiceError carries code+status+correlation
statusReason: .toMatch() expects to receive a string, but got undefined

[Killed] BlockStatement
src/domain/contracts/user-errors.ts:71:27
     this.timestamp = new Date().toISOString();
   }
 
-  toJSON(): UserErrorBody {
-    return {
-      code: this.code,
-      status: this.status,
-      message: this.message,
-      timestamp: this.timestamp,
-      correlationId: this.correlationId,
-      ...(this.detail ? { detail: this.detail } : {}),
-    };
-  }
+  toJSON(): UserErrorBody {}
 }
 
killedBy: view-preference.service UserServiceError surface shape is RFC-7807-compatible
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/domain/contracts/user-errors.ts:87:18
   code: UserErrorCode,
   correlationId?: string,
   detail?: Record<string, unknown>,
-): UserErrorBody {
-  return new UserServiceError(code, correlationId, detail).toJSON();
-}
+): UserErrorBody {}
 
 export function throwUserError(
killedBy: view-preference.service user-errors helpers buildUserError returns a canonical body
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] BlockStatement
src/domain/contracts/user-errors.ts:95:10
   code: UserErrorCode,
   correlationId?: string,
   detail?: Record<string, unknown>,
-): never {
-  throw new UserServiceError(code, correlationId, detail);
-}
+): never {}
 
killedBy: view-preference.service user-errors helpers throwUserError throws a UserServiceError
statusReason: expected function to throw an error, but it didn't
