[Killed] BlockStatement
src/domain/department.service.ts:31:104
 
 export type UpdateDepartmentInput = Partial<CreateDepartmentInput & { status: string }>;
 
-export async function getDepartments(tenantId: string): Promise<{ count: number; rows: Department[] }> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const countResult = await c.query(
-        `SELECT COUNT(*)::int AS count FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL`,
-        [tenantId],
-      );
-      const listResult = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL
-          ORDER BY name_en ASC`,
-        [tenantId],
-      );
-      const rawCount = (countResult.rows[0] as { count?: unknown } | undefined)?.count;
-      const count = Number.isFinite(Number(rawCount)) ? Number(rawCount) : listResult.rows.length;
-      return { count, rows: listResult.rows as Department[] };
-    });
-  } finally {
-    userMetrics.observeDb('dept.list', Date.now() - start);
-  }
-}
+export async function getDepartments(tenantId: string): Promise<{ count: number; rows: Department[] }> {}
 
 export async function getDepartmentById(tenantId: string, deptId: string): Promise<Department | null> {
killedBy: department.service getDepartments returns count + rows
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] BlockStatement
src/domain/department.service.ts:33:7
 
 export async function getDepartments(tenantId: string): Promise<{ count: number; rows: Department[] }> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const countResult = await c.query(
-        `SELECT COUNT(*)::int AS count FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL`,
-        [tenantId],
-      );
-      const listResult = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL
-          ORDER BY name_en ASC`,
-        [tenantId],
-      );
-      const rawCount = (countResult.rows[0] as { count?: unknown } | undefined)?.count;
-      const count = Number.isFinite(Number(rawCount)) ? Number(rawCount) : listResult.rows.length;
-      return { count, rows: listResult.rows as Department[] };
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('dept.list', Date.now() - start);
   }
killedBy: department.service getDepartments returns count + rows
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] BlockStatement
src/domain/department.service.ts:34:58
 export async function getDepartments(tenantId: string): Promise<{ count: number; rows: Department[] }> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const countResult = await c.query(
-        `SELECT COUNT(*)::int AS count FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL`,
-        [tenantId],
-      );
-      const listResult = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL
-          ORDER BY name_en ASC`,
-        [tenantId],
-      );
-      const rawCount = (countResult.rows[0] as { count?: unknown } | undefined)?.count;
-      const count = Number.isFinite(Number(rawCount)) ? Number(rawCount) : listResult.rows.length;
-      return { count, rows: listResult.rows as Department[] };
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('dept.list', Date.now() - start);
killedBy: department.service getDepartments returns count + rows
statusReason: Cannot read properties of undefined (reading 'count')

[Survived] StringLiteral
src/domain/department.service.ts:36:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const countResult = await c.query(
-        `SELECT COUNT(*)::int AS count FROM dos.departments
-          WHERE tenant_id = $1 AND deleted_at IS NULL`,
+        ``,
         [tenantId],
       );

[Survived] ArrayDeclaration
src/domain/department.service.ts:44:9
         `SELECT * FROM dos.departments
           WHERE tenant_id = $1 AND deleted_at IS NULL
           ORDER BY name_en ASC`,
-        [tenantId],
+        [],
       );
       const rawCount = (countResult.rows[0] as { count?: unknown } | undefined)?.count;

[Survived] OptionalChaining
src/domain/department.service.ts:46:24
           ORDER BY name_en ASC`,
         [tenantId],
       );
-      const rawCount = (countResult.rows[0] as { count?: unknown } | undefined)?.count;
+      const rawCount = (countResult.rows[0] as {
+  count?: unknown;
+} | undefined).count;
       const count = Number.isFinite(Number(rawCount)) ? Number(rawCount) : listResult.rows.length;
       return { count, rows: listResult.rows as Department[] };

[Survived] BlockStatement
src/domain/department.service.ts:50:13
       const count = Number.isFinite(Number(rawCount)) ? Number(rawCount) : listResult.rows.length;
       return { count, rows: listResult.rows as Department[] };
     });
-  } finally {
-    userMetrics.observeDb('dept.list', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/department.service.ts:51:40
       return { count, rows: listResult.rows as Department[] };
     });
   } finally {
-    userMetrics.observeDb('dept.list', Date.now() - start);
+    userMetrics.observeDb('dept.list', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/department.service.ts:51:27
       return { count, rows: listResult.rows as Department[] };
     });
   } finally {
-    userMetrics.observeDb('dept.list', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/department.service.ts:55:103
   }
 }
 
-export async function getDepartmentById(tenantId: string, deptId: string): Promise<Department | null> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [deptId, tenantId],
-      );
-      return (result.rows[0] as Department) || null;
-    });
-  } finally {
-    userMetrics.observeDb('dept.getById', Date.now() - start);
-  }
-}
+export async function getDepartmentById(tenantId: string, deptId: string): Promise<Department | null> {}
 
 export async function createDepartment(tenantId: string, payload: CreateDepartmentInput): Promise<Department> {
killedBy: department.service getDepartmentById returns null when not found
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/department.service.ts:57:7
 
 export async function getDepartmentById(tenantId: string, deptId: string): Promise<Department | null> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [deptId, tenantId],
-      );
-      return (result.rows[0] as Department) || null;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('dept.getById', Date.now() - start);
   }
killedBy: department.service getDepartmentById returns null when not found
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/department.service.ts:58:58
 export async function getDepartmentById(tenantId: string, deptId: string): Promise<Department | null> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
-        [deptId, tenantId],
-      );
-      return (result.rows[0] as Department) || null;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('dept.getById', Date.now() - start);
killedBy: department.service getDepartmentById returns null when not found
statusReason: expected undefined to be null

[Killed] StringLiteral
src/domain/department.service.ts:60:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `SELECT * FROM dos.departments
-          WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-          LIMIT 1`,
+        ``,
         [deptId, tenantId],
       );
killedBy: department.service getDepartmentById matches on dept_id or id::text
statusReason: expected '' to match /dept_id = \$1 OR id::text = \$1/

[Killed] ArrayDeclaration
src/domain/department.service.ts:63:9
         `SELECT * FROM dos.departments
           WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
           LIMIT 1`,
-        [deptId, tenantId],
+        [],
       );
       return (result.rows[0] as Department) || null;
killedBy: department.service getDepartmentById scopes tenant in WHERE
statusReason: expected [] to deeply equal [ 'd1', 'tenant-a' ]

[Killed] ConditionalExpression
src/domain/department.service.ts:65:14
           LIMIT 1`,
         [deptId, tenantId],
       );
-      return (result.rows[0] as Department) || null;
+      return false;
     });
   } finally {
killedBy: department.service getDepartmentById returns null when not found
statusReason: expected false to be null

[Killed] ConditionalExpression
src/domain/department.service.ts:65:14
           LIMIT 1`,
         [deptId, tenantId],
       );
-      return (result.rows[0] as Department) || null;
+      return true;
     });
   } finally {
killedBy: department.service getDepartmentById returns null when not found
statusReason: expected true to be null

[Survived] BlockStatement
src/domain/department.service.ts:67:13
       );
       return (result.rows[0] as Department) || null;
     });
-  } finally {
-    userMetrics.observeDb('dept.getById', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/department.service.ts:68:43
       return (result.rows[0] as Department) || null;
     });
   } finally {
-    userMetrics.observeDb('dept.getById', Date.now() - start);
+    userMetrics.observeDb('dept.getById', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/department.service.ts:74:7
 
 export async function createDepartment(tenantId: string, payload: CreateDepartmentInput): Promise<Department> {
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.departments
-           (tenant_id, name_en, name_ar, code, bu_id, head_user_id, parent_id, status, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, $6, $7, 'active', NOW(), NOW())
-         RETURNING *`,
-        [
-          tenantId,
-          payload.name_en,
-          payload.name_ar ?? null,
-          payload.code ?? null,
-          payload.bu_id ?? null,
-          payload.head_user_id ?? null,
-          payload.parent_id ?? null,
-        ],
-      );
-      return result.rows[0] as Department;
-    });
-    userMetrics.deptCreated(tenantId);
-    logger.info('[DepartmentService] Department created', { tenantId, name_en: payload.name_en });
-    return row;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('dept.create', Date.now() - start);
   }
killedBy: department.service createDepartment inserts with tenant scope
statusReason: Cannot read properties of undefined (reading 'dept_id')

[Killed] BlockStatement
src/domain/department.service.ts:75:63
 export async function createDepartment(tenantId: string, payload: CreateDepartmentInput): Promise<Department> {
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.departments
-           (tenant_id, name_en, name_ar, code, bu_id, head_user_id, parent_id, status, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, $6, $7, 'active', NOW(), NOW())
-         RETURNING *`,
-        [
-          tenantId,
-          payload.name_en,
-          payload.name_ar ?? null,
-          payload.code ?? null,
-          payload.bu_id ?? null,
-          payload.head_user_id ?? null,
-          payload.parent_id ?? null,
-        ],
-      );
-      return result.rows[0] as Department;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.deptCreated(tenantId);
     logger.info('[DepartmentService] Department created', { tenantId, name_en: payload.name_en });
killedBy: department.service createDepartment inserts with tenant scope
statusReason: Cannot read properties of undefined (reading 'dept_id')

[Survived] StringLiteral
src/domain/department.service.ts:77:9
   try {
     const row = await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `INSERT INTO dos.departments
-           (tenant_id, name_en, name_ar, code, bu_id, head_user_id, parent_id, status, created_at, updated_at)
-         VALUES ($1, $2, $3, $4, $5, $6, $7, 'active', NOW(), NOW())
-         RETURNING *`,
+        ``,
         [
           tenantId,

[Killed] LogicalOperator
src/domain/department.service.ts:84:11
         [
           tenantId,
           payload.name_en,
-          payload.name_ar ?? null,
+          payload.name_ar && null,
           payload.code ?? null,
           payload.bu_id ?? null,
killedBy: department.service createDepartment persists all optional fields as provided (not nulls)
statusReason: expected [ 'tenant-a', 'Engineering', …(5) ] to deeply equal [ 'tenant-a', 'Engineering', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:85:11
           tenantId,
           payload.name_en,
           payload.name_ar ?? null,
-          payload.code ?? null,
+          payload.code && null,
           payload.bu_id ?? null,
           payload.head_user_id ?? null,
killedBy: department.service createDepartment persists all optional fields as provided (not nulls)
statusReason: expected [ 'tenant-a', 'Engineering', …(5) ] to deeply equal [ 'tenant-a', 'Engineering', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:86:11
           payload.name_en,
           payload.name_ar ?? null,
           payload.code ?? null,
-          payload.bu_id ?? null,
+          payload.bu_id && null,
           payload.head_user_id ?? null,
           payload.parent_id ?? null,
killedBy: department.service createDepartment persists all optional fields as provided (not nulls)
statusReason: expected [ 'tenant-a', 'Engineering', …(5) ] to deeply equal [ 'tenant-a', 'Engineering', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:87:11
           payload.name_ar ?? null,
           payload.code ?? null,
           payload.bu_id ?? null,
-          payload.head_user_id ?? null,
+          payload.head_user_id && null,
           payload.parent_id ?? null,
         ],
killedBy: department.service createDepartment persists all optional fields as provided (not nulls)
statusReason: expected [ 'tenant-a', 'Engineering', …(5) ] to deeply equal [ 'tenant-a', 'Engineering', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:88:11
           payload.code ?? null,
           payload.bu_id ?? null,
           payload.head_user_id ?? null,
-          payload.parent_id ?? null,
+          payload.parent_id && null,
         ],
       );
killedBy: department.service createDepartment persists all optional fields as provided (not nulls)
statusReason: expected [ 'tenant-a', 'Engineering', …(5) ] to deeply equal [ 'tenant-a', 'Engineering', …(5) ]

[Survived] StringLiteral
src/domain/department.service.ts:94:17
       return result.rows[0] as Department;
     });
     userMetrics.deptCreated(tenantId);
-    logger.info('[DepartmentService] Department created', { tenantId, name_en: payload.name_en });
+    logger.info("", { tenantId, name_en: payload.name_en });
     return row;
   } finally {

[Survived] BlockStatement
src/domain/department.service.ts:96:13
     userMetrics.deptCreated(tenantId);
     logger.info('[DepartmentService] Department created', { tenantId, name_en: payload.name_en });
     return row;
-  } finally {
-    userMetrics.observeDb('dept.create', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/department.service.ts:97:42
     logger.info('[DepartmentService] Department created', { tenantId, name_en: payload.name_en });
     return row;
   } finally {
-    userMetrics.observeDb('dept.create', Date.now() - start);
+    userMetrics.observeDb('dept.create', Date.now() + start);
   }
 }

[Killed] StringLiteral
src/domain/department.service.ts:110:9
   try {
     const row = await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `UPDATE dos.departments
-         SET name_en      = COALESCE($3, name_en),
-             name_ar      = COALESCE($4, name_ar),
-             code         = COALESCE($5, code),
-             bu_id        = COALESCE($6, bu_id),
-             head_user_id = COALESCE($7, head_user_id),
-             parent_id    = COALESCE($8, parent_id),
-             status       = COALESCE($9, status),
-             updated_at   = NOW()
-         WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING *`,
+        ``,
         [
           deptId,
killedBy: department.service updateDepartment writes tenant in WHERE
statusReason: expected '' to match /AND tenant_id = \$2/

[Killed] LogicalOperator
src/domain/department.service.ts:124:11
         [
           deptId,
           tenantId,
-          payload.name_en ?? null,
+          payload.name_en && null,
           payload.name_ar ?? null,
           payload.code ?? null,
killedBy: department.service updateDepartment writes all provided fields and NOW() for updated_at
statusReason: expected [ 'd1', 'tenant-a', null, 'H2', …(5) ] to deeply equal [ 'd1', 'tenant-a', 'E2', 'H2', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:125:11
           deptId,
           tenantId,
           payload.name_en ?? null,
-          payload.name_ar ?? null,
+          payload.name_ar && null,
           payload.code ?? null,
           payload.bu_id ?? null,
killedBy: department.service updateDepartment writes all provided fields and NOW() for updated_at
statusReason: expected [ 'd1', 'tenant-a', 'E2', null, …(5) ] to deeply equal [ 'd1', 'tenant-a', 'E2', 'H2', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:130:11
           payload.bu_id ?? null,
           payload.head_user_id ?? null,
           payload.parent_id ?? null,
-          payload.status ?? null,
+          payload.status && null,
         ],
       );
killedBy: department.service updateDepartment writes all provided fields and NOW() for updated_at
statusReason: expected [ 'd1', 'tenant-a', 'E2', 'H2', …(5) ] to deeply equal [ 'd1', 'tenant-a', 'E2', 'H2', …(5) ]

[Killed] LogicalOperator
src/domain/department.service.ts:133:14
           payload.status ?? null,
         ],
       );
-      return (result.rows[0] as Department) || null;
+      return result.rows[0] as Department && null;
     });
     if (row) userMetrics.deptUpdated(tenantId);
killedBy: department.service updateDepartment returns null when not found
statusReason: expected undefined to be null

[Survived] ConditionalExpression
src/domain/department.service.ts:135:9
       );
       return (result.rows[0] as Department) || null;
     });
-    if (row) userMetrics.deptUpdated(tenantId);
+    if (false) userMetrics.deptUpdated(tenantId);
     return row;
   } finally {

[Survived] ConditionalExpression
src/domain/department.service.ts:135:9
       );
       return (result.rows[0] as Department) || null;
     });
-    if (row) userMetrics.deptUpdated(tenantId);
+    if (true) userMetrics.deptUpdated(tenantId);
     return row;
   } finally {

[Survived] BlockStatement
src/domain/department.service.ts:137:13
     });
     if (row) userMetrics.deptUpdated(tenantId);
     return row;
-  } finally {
-    userMetrics.observeDb('dept.update', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/department.service.ts:138:42
     if (row) userMetrics.deptUpdated(tenantId);
     return row;
   } finally {
-    userMetrics.observeDb('dept.update', Date.now() - start);
+    userMetrics.observeDb('dept.update', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/department.service.ts:142:105
   }
 }
 
-export async function deleteDepartment(tenantId: string, deptId: string): Promise<{ deleted: boolean }> {
-  const start = Date.now();
-  try {
-    const deleted = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.departments
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING dept_id`,
-        [deptId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (deleted) userMetrics.deptDeleted(tenantId);
-    return { deleted };
-  } finally {
-    userMetrics.observeDb('dept.delete', Date.now() - start);
-  }
-}
+export async function deleteDepartment(tenantId: string, deptId: string): Promise<{ deleted: boolean }> {}
 
killedBy: department.service deleteDepartment is soft-delete
statusReason: Cannot read properties of undefined (reading 'deleted')

[Killed] BlockStatement
src/domain/department.service.ts:144:7
 
 export async function deleteDepartment(tenantId: string, deptId: string): Promise<{ deleted: boolean }> {
   const start = Date.now();
-  try {
-    const deleted = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.departments
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING dept_id`,
-        [deptId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (deleted) userMetrics.deptDeleted(tenantId);
-    return { deleted };
-  } finally {
+  try {} finally {
     userMetrics.observeDb('dept.delete', Date.now() - start);
   }
killedBy: department.service deleteDepartment is soft-delete
statusReason: Cannot read properties of undefined (reading 'deleted')

[Killed] BlockStatement
src/domain/department.service.ts:145:67
 export async function deleteDepartment(tenantId: string, deptId: string): Promise<{ deleted: boolean }> {
   const start = Date.now();
   try {
-    const deleted = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.departments
-         SET deleted_at = NOW(), updated_at = NOW()
-         WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
-         RETURNING dept_id`,
-        [deptId, tenantId],
-      );
-      return result.rows.length > 0;
-    });
+    const deleted = await withTenantClient(tenantId, async (c) => {});
     if (deleted) userMetrics.deptDeleted(tenantId);
     return { deleted };
killedBy: department.service deleteDepartment is soft-delete
statusReason: expected undefined to be true // Object.is equality

[Survived] ArrayDeclaration
src/domain/department.service.ts:151:9
          SET deleted_at = NOW(), updated_at = NOW()
          WHERE (dept_id = $1 OR id::text = $1) AND tenant_id = $2 AND deleted_at IS NULL
          RETURNING dept_id`,
-        [deptId, tenantId],
+        [],
       );
       return result.rows.length > 0;

[Survived] ConditionalExpression
src/domain/department.service.ts:155:9
       );
       return result.rows.length > 0;
     });
-    if (deleted) userMetrics.deptDeleted(tenantId);
+    if (true) userMetrics.deptDeleted(tenantId);
     return { deleted };
   } finally {

[Survived] ConditionalExpression
src/domain/department.service.ts:155:9
       );
       return result.rows.length > 0;
     });
-    if (deleted) userMetrics.deptDeleted(tenantId);
+    if (false) userMetrics.deptDeleted(tenantId);
     return { deleted };
   } finally {

[Survived] BlockStatement
src/domain/department.service.ts:157:13
     });
     if (deleted) userMetrics.deptDeleted(tenantId);
     return { deleted };
-  } finally {
-    userMetrics.observeDb('dept.delete', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/department.service.ts:158:42
     if (deleted) userMetrics.deptDeleted(tenantId);
     return { deleted };
   } finally {
-    userMetrics.observeDb('dept.delete', Date.now() - start);
+    userMetrics.observeDb('dept.delete', Date.now() + start);
   }
 }
