[Killed] BlockStatement
src/domain/role-assignment.service.ts:18:104
   is_active: boolean;
 }
 
-export async function listRoleAssignments(tenantId: string, userId: string): Promise<RoleAssignment[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, tenant_id, user_id, role_code, scope, granted_by, granted_at, expires_at, is_active
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND user_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [tenantId, userId],
-      );
-      return result.rows as RoleAssignment[];
-    });
-  } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
-    return [];
-  } finally {
-    userMetrics.observeDb('roleAssignment.list', Date.now() - start);
-  }
-}
+export async function listRoleAssignments(tenantId: string, userId: string): Promise<RoleAssignment[]> {}
 
 export async function assignRole(
killedBy: role-assignment.service listRoleAssignments scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/domain/role-assignment.service.ts:20:7
 
 export async function listRoleAssignments(tenantId: string, userId: string): Promise<RoleAssignment[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, tenant_id, user_id, role_code, scope, granted_by, granted_at, expires_at, is_active
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND user_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [tenantId, userId],
-      );
-      return result.rows as RoleAssignment[];
-    });
-  } catch (err) {
+  try {} catch (err) {
     logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
     return [];
killedBy: role-assignment.service listRoleAssignments scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/domain/role-assignment.service.ts:21:58
 export async function listRoleAssignments(tenantId: string, userId: string): Promise<RoleAssignment[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, tenant_id, user_id, role_code, scope, granted_by, granted_at, expires_at, is_active
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND user_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [tenantId, userId],
-      );
-      return result.rows as RoleAssignment[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } catch (err) {
     logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
killedBy: role-assignment.service listRoleAssignments scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] ArrayDeclaration
src/domain/role-assignment.service.ts:27:9
            FROM dos.user_role_assignments
           WHERE tenant_id = $1 AND user_id = $2 AND is_active = TRUE
           ORDER BY granted_at DESC`,
-        [tenantId, userId],
+        [],
       );
       return result.rows as RoleAssignment[];
killedBy: role-assignment.service listRoleAssignments scopes by tenant + user + active
statusReason: expected [] to deeply equal [ 'tenant-a', 'u1' ]

[Killed] BlockStatement
src/domain/role-assignment.service.ts:31:17
       );
       return result.rows as RoleAssignment[];
     });
-  } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
-    return [];
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('roleAssignment.list', Date.now() - start);
   }
killedBy: role-assignment.service listRoleAssignments returns [] and logs on failure
statusReason: expected undefined to deeply equal []

[Survived] StringLiteral
src/domain/role-assignment.service.ts:32:18
       return result.rows as RoleAssignment[];
     });
   } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
+    logger.error("", { tenantId, userId, error: toErrorMessage(err) });
     return [];
   } finally {

[Survived] BlockStatement
src/domain/role-assignment.service.ts:34:13
   } catch (err) {
     logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
     return [];
-  } finally {
-    userMetrics.observeDb('roleAssignment.list', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role-assignment.service.ts:35:50
     logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
     return [];
   } finally {
-    userMetrics.observeDb('roleAssignment.list', Date.now() - start);
+    userMetrics.observeDb('roleAssignment.list', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/role-assignment.service.ts:35:27
     logger.error('[RoleAssignmentService] Failed to list role assignments', { tenantId, userId, error: toErrorMessage(err) });
     return [];
   } finally {
-    userMetrics.observeDb('roleAssignment.list', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/role-assignment.service.ts:48:7
   const id = randomUUID();
   const start = Date.now();
 
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.user_role_assignments
-           (assignment_id, tenant_id, user_id, role_code, granted_by, granted_at, is_active)
-         VALUES ($1, $2, $3, $4, $5, NOW(), TRUE)
-         ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
-           DO UPDATE SET granted_by = EXCLUDED.granted_by, granted_at = NOW()
-         RETURNING assignment_id, tenant_id, user_id, role_code, scope, granted_by, granted_at, expires_at, is_active`,
-        [id, tenantId, userId, roleCode, assignedBy],
-      );
-      return result.rows[0] as RoleAssignment;
-    });
-    userMetrics.roleAssigned(tenantId, roleCode);
-    logger.info('[RoleAssignmentService] Role assigned', { tenantId, userId, roleCode, assignedBy });
-    return row;
-  } catch (err) {
+  try {} catch (err) {
     logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
     throw err;
killedBy: role-assignment.service assignRole writes tenant and grantor
statusReason: Cannot read properties of undefined (reading 'tenant_id')

[Killed] BlockStatement
src/domain/role-assignment.service.ts:49:63
   const start = Date.now();
 
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.user_role_assignments
-           (assignment_id, tenant_id, user_id, role_code, granted_by, granted_at, is_active)
-         VALUES ($1, $2, $3, $4, $5, NOW(), TRUE)
-         ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
-           DO UPDATE SET granted_by = EXCLUDED.granted_by, granted_at = NOW()
-         RETURNING assignment_id, tenant_id, user_id, role_code, scope, granted_by, granted_at, expires_at, is_active`,
-        [id, tenantId, userId, roleCode, assignedBy],
-      );
-      return result.rows[0] as RoleAssignment;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.roleAssigned(tenantId, roleCode);
     logger.info('[RoleAssignmentService] Role assigned', { tenantId, userId, roleCode, assignedBy });
killedBy: role-assignment.service assignRole writes tenant and grantor
statusReason: Cannot read properties of undefined (reading 'tenant_id')

[Survived] StringLiteral
src/domain/role-assignment.service.ts:62:17
       return result.rows[0] as RoleAssignment;
     });
     userMetrics.roleAssigned(tenantId, roleCode);
-    logger.info('[RoleAssignmentService] Role assigned', { tenantId, userId, roleCode, assignedBy });
+    logger.info("", { tenantId, userId, roleCode, assignedBy });
     return row;
   } catch (err) {

[Killed] BlockStatement
src/domain/role-assignment.service.ts:64:17
     userMetrics.roleAssigned(tenantId, roleCode);
     logger.info('[RoleAssignmentService] Role assigned', { tenantId, userId, roleCode, assignedBy });
     return row;
-  } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('roleAssignment.assign', Date.now() - start);
   }
killedBy: role-assignment.service assignRole re-throws and logs on DB failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] ObjectLiteral
src/domain/role-assignment.service.ts:65:67
     logger.info('[RoleAssignmentService] Role assigned', { tenantId, userId, roleCode, assignedBy });
     return row;
   } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
+    logger.error('[RoleAssignmentService] Failed to assign role', {});
     throw err;
   } finally {

[Survived] BlockStatement
src/domain/role-assignment.service.ts:67:13
   } catch (err) {
     logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
     throw err;
-  } finally {
-    userMetrics.observeDb('roleAssignment.assign', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role-assignment.service.ts:68:52
     logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('roleAssignment.assign', Date.now() - start);
+    userMetrics.observeDb('roleAssignment.assign', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/role-assignment.service.ts:68:27
     logger.error('[RoleAssignmentService] Failed to assign role', { tenantId, userId, roleCode, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('roleAssignment.assign', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/role-assignment.service.ts:74:7
 
 export async function revokeRoleAssignment(tenantId: string, userId: string, assignmentId: string): Promise<boolean> {
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.user_role_assignments
-         SET is_active = FALSE, revoked_at = NOW()
-         WHERE assignment_id = $1 AND tenant_id = $2 AND user_id = $3 AND is_active = TRUE
-         RETURNING assignment_id, role_code`,
-        [assignmentId, tenantId, userId],
-      );
-      return result.rows[0] as { assignment_id: string; role_code: string } | undefined;
-    });
-    if (row) {
-      userMetrics.roleRevoked(tenantId, row.role_code);
-      logger.info('[RoleAssignmentService] Role revoked', { tenantId, userId, assignmentId, roleCode: row.role_code });
-      return true;
-    }
-    return false;
-  } catch (err) {
+  try {} catch (err) {
     logger.error('[RoleAssignmentService] Failed to revoke role assignment', { tenantId, userId, assignmentId, error: toErrorMessage(err) });
     throw err;
killedBy: role-assignment.service revokeRoleAssignment returns true only when row updated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/role-assignment.service.ts:75:63
 export async function revokeRoleAssignment(tenantId: string, userId: string, assignmentId: string): Promise<boolean> {
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.user_role_assignments
-         SET is_active = FALSE, revoked_at = NOW()
-         WHERE assignment_id = $1 AND tenant_id = $2 AND user_id = $3 AND is_active = TRUE
-         RETURNING assignment_id, role_code`,
-        [assignmentId, tenantId, userId],
-      );
-      return result.rows[0] as { assignment_id: string; role_code: string } | undefined;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     if (row) {
       userMetrics.roleRevoked(tenantId, row.role_code);
killedBy: role-assignment.service revokeRoleAssignment returns true only when row updated
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/domain/role-assignment.service.ts:85:9
       );
       return result.rows[0] as { assignment_id: string; role_code: string } | undefined;
     });
-    if (row) {
+    if (false) {
       userMetrics.roleRevoked(tenantId, row.role_code);
       logger.info('[RoleAssignmentService] Role revoked', { tenantId, userId, assignmentId, roleCode: row.role_code });
killedBy: role-assignment.service revokeRoleAssignment returns true only when row updated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/role-assignment.service.ts:85:14
       );
       return result.rows[0] as { assignment_id: string; role_code: string } | undefined;
     });
-    if (row) {
-      userMetrics.roleRevoked(tenantId, row.role_code);
-      logger.info('[RoleAssignmentService] Role revoked', { tenantId, userId, assignmentId, roleCode: row.role_code });
-      return true;
-    }
+    if (row) {}
     return false;
   } catch (err) {
killedBy: role-assignment.service revokeRoleAssignment returns true only when row updated
statusReason: expected false to be true // Object.is equality

[Survived] ObjectLiteral
src/domain/role-assignment.service.ts:87:59
     });
     if (row) {
       userMetrics.roleRevoked(tenantId, row.role_code);
-      logger.info('[RoleAssignmentService] Role revoked', { tenantId, userId, assignmentId, roleCode: row.role_code });
+      logger.info('[RoleAssignmentService] Role revoked', {});
       return true;
     }

[Killed] BooleanLiteral
src/domain/role-assignment.service.ts:88:14
     if (row) {
       userMetrics.roleRevoked(tenantId, row.role_code);
       logger.info('[RoleAssignmentService] Role revoked', { tenantId, userId, assignmentId, roleCode: row.role_code });
-      return true;
+      return false;
     }
     return false;
killedBy: role-assignment.service revokeRoleAssignment returns true only when row updated
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/domain/role-assignment.service.ts:91:17
       return true;
     }
     return false;
-  } catch (err) {
-    logger.error('[RoleAssignmentService] Failed to revoke role assignment', { tenantId, userId, assignmentId, error: toErrorMessage(err) });
-    throw err;
-  } finally {
+  } catch (err) {} finally {
     userMetrics.observeDb('roleAssignment.revoke', Date.now() - start);
   }
killedBy: role-assignment.service revokeRoleAssignment logs and re-throws on DB failure
statusReason: promise resolved "undefined" instead of rejecting

[Survived] BlockStatement
src/domain/role-assignment.service.ts:94:13
   } catch (err) {
     logger.error('[RoleAssignmentService] Failed to revoke role assignment', { tenantId, userId, assignmentId, error: toErrorMessage(err) });
     throw err;
-  } finally {
-    userMetrics.observeDb('roleAssignment.revoke', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role-assignment.service.ts:95:52
     logger.error('[RoleAssignmentService] Failed to revoke role assignment', { tenantId, userId, assignmentId, error: toErrorMessage(err) });
     throw err;
   } finally {
-    userMetrics.observeDb('roleAssignment.revoke', Date.now() - start);
+    userMetrics.observeDb('roleAssignment.revoke', Date.now() + start);
   }
 }

[Survived] ObjectLiteral
src/domain/role-assignment.service.ts:99:38
   }
 }
 
-export const RoleAssignmentService = {
-  listRoleAssignments,
-  assignRole,
-  revokeRoleAssignment,
-};
+export const RoleAssignmentService = {};
 
