[Killed] BlockStatement
src/domain/role.service.ts:21:102
   count: number;
 }
 
-export async function listUserRoles(tenantId: string, userId: string): Promise<UserRoleAssignment[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active
-           FROM dos.user_role_assignments
-          WHERE user_id = $1 AND tenant_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [userId, tenantId],
-      );
-      return result.rows as UserRoleAssignment[];
-    });
-  } finally {
-    userMetrics.observeDb('role.list', Date.now() - start);
-  }
-}
+export async function listUserRoles(tenantId: string, userId: string): Promise<UserRoleAssignment[]> {}
 
 export async function assignRole(
killedBy: role.service listUserRoles scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/domain/role.service.ts:23:7
 
 export async function listUserRoles(tenantId: string, userId: string): Promise<UserRoleAssignment[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active
-           FROM dos.user_role_assignments
-          WHERE user_id = $1 AND tenant_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [userId, tenantId],
-      );
-      return result.rows as UserRoleAssignment[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('role.list', Date.now() - start);
   }
killedBy: role.service listUserRoles scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/domain/role.service.ts:24:58
 export async function listUserRoles(tenantId: string, userId: string): Promise<UserRoleAssignment[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active
-           FROM dos.user_role_assignments
-          WHERE user_id = $1 AND tenant_id = $2 AND is_active = TRUE
-          ORDER BY granted_at DESC`,
-        [userId, tenantId],
-      );
-      return result.rows as UserRoleAssignment[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('role.list', Date.now() - start);
killedBy: role.service listUserRoles scopes by tenant + user + active
statusReason: Target cannot be null or undefined.

[Killed] ArrayDeclaration
src/domain/role.service.ts:30:9
            FROM dos.user_role_assignments
           WHERE user_id = $1 AND tenant_id = $2 AND is_active = TRUE
           ORDER BY granted_at DESC`,
-        [userId, tenantId],
+        [],
       );
       return result.rows as UserRoleAssignment[];
killedBy: role.service listUserRoles scopes by tenant + user + active
statusReason: expected [] to deeply equal [ 'u1', 'tenant-a' ]

[Survived] BlockStatement
src/domain/role.service.ts:34:13
       );
       return result.rows as UserRoleAssignment[];
     });
-  } finally {
-    userMetrics.observeDb('role.list', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role.service.ts:35:40
       return result.rows as UserRoleAssignment[];
     });
   } finally {
-    userMetrics.observeDb('role.list', Date.now() - start);
+    userMetrics.observeDb('role.list', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/role.service.ts:44:32
   userId: string,
   roleCode: string,
   grantedBy?: string,
-): Promise<UserRoleAssignment> {
-  const id = randomUUID();
-  const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.user_role_assignments
-           (assignment_id, tenant_id, user_id, role_code, granted_by, granted_at, is_active)
-         VALUES ($1, $2, $3, $4, $5, NOW(), TRUE)
-         ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
-           DO UPDATE SET granted_at = NOW(), granted_by = EXCLUDED.granted_by
-         RETURNING assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active`,
-        [id, tenantId, userId, roleCode, grantedBy ?? null],
-      );
-      return result.rows[0] as UserRoleAssignment;
-    });
-    userMetrics.roleAssigned(tenantId, roleCode);
-    return row;
-  } finally {
-    userMetrics.observeDb('role.assign', Date.now() - start);
-  }
-}
+): Promise<UserRoleAssignment> {}
 
 export async function revokeRole(tenantId: string, userId: string, roleCode: string): Promise<boolean> {
killedBy: role.service assignRole writes tenant_id into the row
statusReason: Cannot read properties of undefined (reading 'tenant_id')

[Killed] BlockStatement
src/domain/role.service.ts:47:7
 ): Promise<UserRoleAssignment> {
   const id = randomUUID();
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.user_role_assignments
-           (assignment_id, tenant_id, user_id, role_code, granted_by, granted_at, is_active)
-         VALUES ($1, $2, $3, $4, $5, NOW(), TRUE)
-         ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
-           DO UPDATE SET granted_at = NOW(), granted_by = EXCLUDED.granted_by
-         RETURNING assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active`,
-        [id, tenantId, userId, roleCode, grantedBy ?? null],
-      );
-      return result.rows[0] as UserRoleAssignment;
-    });
-    userMetrics.roleAssigned(tenantId, roleCode);
-    return row;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('role.assign', Date.now() - start);
   }
killedBy: role.service assignRole writes tenant_id into the row
statusReason: Cannot read properties of undefined (reading 'tenant_id')

[Killed] BlockStatement
src/domain/role.service.ts:48:63
   const id = randomUUID();
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO dos.user_role_assignments
-           (assignment_id, tenant_id, user_id, role_code, granted_by, granted_at, is_active)
-         VALUES ($1, $2, $3, $4, $5, NOW(), TRUE)
-         ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
-           DO UPDATE SET granted_at = NOW(), granted_by = EXCLUDED.granted_by
-         RETURNING assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active`,
-        [id, tenantId, userId, roleCode, grantedBy ?? null],
-      );
-      return result.rows[0] as UserRoleAssignment;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.roleAssigned(tenantId, roleCode);
     return row;
killedBy: role.service assignRole writes tenant_id into the row
statusReason: Cannot read properties of undefined (reading 'tenant_id')

[Survived] LogicalOperator
src/domain/role.service.ts:56:42
          ON CONFLICT (tenant_id, user_id, role_code) WHERE is_active = TRUE
            DO UPDATE SET granted_at = NOW(), granted_by = EXCLUDED.granted_by
          RETURNING assignment_id, user_id, role_code, tenant_id, scope, granted_by, granted_at, is_active`,
-        [id, tenantId, userId, roleCode, grantedBy ?? null],
+        [id, tenantId, userId, roleCode, grantedBy && null],
       );
       return result.rows[0] as UserRoleAssignment;

[Survived] BlockStatement
src/domain/role.service.ts:62:13
     });
     userMetrics.roleAssigned(tenantId, roleCode);
     return row;
-  } finally {
-    userMetrics.observeDb('role.assign', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role.service.ts:63:42
     userMetrics.roleAssigned(tenantId, roleCode);
     return row;
   } finally {
-    userMetrics.observeDb('role.assign', Date.now() - start);
+    userMetrics.observeDb('role.assign', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/role.service.ts:63:27
     userMetrics.roleAssigned(tenantId, roleCode);
     return row;
   } finally {
-    userMetrics.observeDb('role.assign', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/role.service.ts:67:104
   }
 }
 
-export async function revokeRole(tenantId: string, userId: string, roleCode: string): Promise<boolean> {
-  const start = Date.now();
-  try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.user_role_assignments
-         SET is_active = FALSE, revoked_at = NOW()
-         WHERE user_id = $1 AND role_code = $2 AND tenant_id = $3 AND is_active = TRUE
-         RETURNING assignment_id`,
-        [userId, roleCode, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
-    return revoked;
-  } finally {
-    userMetrics.observeDb('role.revoke', Date.now() - start);
-  }
-}
+export async function revokeRole(tenantId: string, userId: string, roleCode: string): Promise<boolean> {}
 
 export async function listAvailableRoles(tenantId: string): Promise<AvailableRole[]> {
killedBy: role.service revokeRole returns true only when a row was updated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/role.service.ts:69:7
 
 export async function revokeRole(tenantId: string, userId: string, roleCode: string): Promise<boolean> {
   const start = Date.now();
-  try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.user_role_assignments
-         SET is_active = FALSE, revoked_at = NOW()
-         WHERE user_id = $1 AND role_code = $2 AND tenant_id = $3 AND is_active = TRUE
-         RETURNING assignment_id`,
-        [userId, roleCode, tenantId],
-      );
-      return result.rows.length > 0;
-    });
-    if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
-    return revoked;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('role.revoke', Date.now() - start);
   }
killedBy: role.service revokeRole returns true only when a row was updated
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/domain/role.service.ts:70:67
 export async function revokeRole(tenantId: string, userId: string, roleCode: string): Promise<boolean> {
   const start = Date.now();
   try {
-    const revoked = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `UPDATE dos.user_role_assignments
-         SET is_active = FALSE, revoked_at = NOW()
-         WHERE user_id = $1 AND role_code = $2 AND tenant_id = $3 AND is_active = TRUE
-         RETURNING assignment_id`,
-        [userId, roleCode, tenantId],
-      );
-      return result.rows.length > 0;
-    });
+    const revoked = await withTenantClient(tenantId, async (c) => {});
     if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
     return revoked;
killedBy: role.service revokeRole returns true only when a row was updated
statusReason: expected undefined to be true // Object.is equality

[Survived] ConditionalExpression
src/domain/role.service.ts:80:9
       );
       return result.rows.length > 0;
     });
-    if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
+    if (true) userMetrics.roleRevoked(tenantId, roleCode);
     return revoked;
   } finally {

[Survived] ConditionalExpression
src/domain/role.service.ts:80:9
       );
       return result.rows.length > 0;
     });
-    if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
+    if (false) userMetrics.roleRevoked(tenantId, roleCode);
     return revoked;
   } finally {

[Survived] BlockStatement
src/domain/role.service.ts:82:13
     });
     if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
     return revoked;
-  } finally {
-    userMetrics.observeDb('role.revoke', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role.service.ts:83:42
     if (revoked) userMetrics.roleRevoked(tenantId, roleCode);
     return revoked;
   } finally {
-    userMetrics.observeDb('role.revoke', Date.now() - start);
+    userMetrics.observeDb('role.revoke', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/role.service.ts:87:86
   }
 }
 
-export async function listAvailableRoles(tenantId: string): Promise<AvailableRole[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT role_code, COUNT(*)::int AS count
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND is_active = TRUE
-          GROUP BY role_code
-          ORDER BY role_code`,
-        [tenantId],
-      );
-      return result.rows as AvailableRole[];
-    });
-  } finally {
-    userMetrics.observeDb('role.listAvailable', Date.now() - start);
-  }
-}
+export async function listAvailableRoles(tenantId: string): Promise<AvailableRole[]> {}
 
killedBy: role.service listAvailableRoles groups by role_code within tenant
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/domain/role.service.ts:89:7
 
 export async function listAvailableRoles(tenantId: string): Promise<AvailableRole[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT role_code, COUNT(*)::int AS count
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND is_active = TRUE
-          GROUP BY role_code
-          ORDER BY role_code`,
-        [tenantId],
-      );
-      return result.rows as AvailableRole[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('role.listAvailable', Date.now() - start);
   }
killedBy: role.service listAvailableRoles groups by role_code within tenant
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/domain/role.service.ts:90:58
 export async function listAvailableRoles(tenantId: string): Promise<AvailableRole[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT role_code, COUNT(*)::int AS count
-           FROM dos.user_role_assignments
-          WHERE tenant_id = $1 AND is_active = TRUE
-          GROUP BY role_code
-          ORDER BY role_code`,
-        [tenantId],
-      );
-      return result.rows as AvailableRole[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('role.listAvailable', Date.now() - start);
killedBy: role.service listAvailableRoles groups by role_code within tenant
statusReason: Cannot read properties of undefined (reading '0')

[Survived] BlockStatement
src/domain/role.service.ts:101:13
       );
       return result.rows as AvailableRole[];
     });
-  } finally {
-    userMetrics.observeDb('role.listAvailable', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/role.service.ts:102:49
       return result.rows as AvailableRole[];
     });
   } finally {
-    userMetrics.observeDb('role.listAvailable', Date.now() - start);
+    userMetrics.observeDb('role.listAvailable', Date.now() + start);
   }
 }
