[Killed] Regex
src/domain/view-preference.service.ts:17:19
   user_id: string;
 }
 
-const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}$/;
+const MODULE_RE = /[a-z][a-z0-9_-]{0,63}$/;
 const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
 const MAX_CONFIG_BYTES = 64 * 1024;
killedBy: view-preference.service assertModuleView rejects invalid keys module=%p view=%p Bad ok
statusReason: expected function to throw an error, but it didn't

[Killed] Regex
src/domain/view-preference.service.ts:17:19
   user_id: string;
 }
 
-const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}$/;
+const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}/;
 const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
 const MAX_CONFIG_BYTES = 64 * 1024;
killedBy: view-preference.service assertModuleView rejects invalid keys module=%p view=%p risk! ok
statusReason: expected function to throw an error, but it didn't

[Killed] Regex
src/domain/view-preference.service.ts:18:17
 }
 
 const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}$/;
-const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
+const VIEW_RE = /^[a-z][^a-z0-9_-]{0,63}$/;
 const MAX_CONFIG_BYTES = 64 * 1024;
 
killedBy: view-preference.service assertModuleView accepts valid keys
statusReason: expected [Function] to not throw an error but 'UserServiceError: Invalid module or v…' was thrown

[Survived] Regex
src/domain/view-preference.service.ts:18:17
 }
 
 const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}$/;
-const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
+const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}/;
 const MAX_CONFIG_BYTES = 64 * 1024;
 

[Killed] ArithmeticOperator
src/domain/view-preference.service.ts:19:26
 
 const MODULE_RE = /^[a-z][a-z0-9_-]{0,63}$/;
 const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
-const MAX_CONFIG_BYTES = 64 * 1024;
+const MAX_CONFIG_BYTES = 64 / 1024;
 
 export function assertModuleView(moduleCode: string, viewKey: string): void {
killedBy: view-preference.service upsert inserts with tenant scoping
statusReason: Configuration exceeds size limit

[Killed] BlockStatement
src/domain/view-preference.service.ts:21:77
 const VIEW_RE = /^[a-z][a-z0-9_-]{0,63}$/;
 const MAX_CONFIG_BYTES = 64 * 1024;
 
-export function assertModuleView(moduleCode: string, viewKey: string): void {
-  if (!MODULE_RE.test(moduleCode) || !VIEW_RE.test(viewKey)) {
-    throw new UserServiceError('VIEW_PREF_INVALID_KEY', undefined, { moduleCode, viewKey });
-  }
-}
+export function assertModuleView(moduleCode: string, viewKey: string): void {}
 
 function assertConfigSize(config: unknown): void {
killedBy: view-preference.service assertModuleView rejects invalid keys module=%p view=%p  view
statusReason: expected function to throw an error, but it didn't

[Killed] BooleanLiteral
src/domain/view-preference.service.ts:22:7
 const MAX_CONFIG_BYTES = 64 * 1024;
 
 export function assertModuleView(moduleCode: string, viewKey: string): void {
-  if (!MODULE_RE.test(moduleCode) || !VIEW_RE.test(viewKey)) {
+  if (MODULE_RE.test(moduleCode) || !VIEW_RE.test(viewKey)) {
     throw new UserServiceError('VIEW_PREF_INVALID_KEY', undefined, { moduleCode, viewKey });
   }
killedBy: view-preference.service assertModuleView accepts valid keys
statusReason: expected [Function] to not throw an error but 'UserServiceError: Invalid module or v…' was thrown

[Killed] LogicalOperator
src/domain/view-preference.service.ts:22:7
 const MAX_CONFIG_BYTES = 64 * 1024;
 
 export function assertModuleView(moduleCode: string, viewKey: string): void {
-  if (!MODULE_RE.test(moduleCode) || !VIEW_RE.test(viewKey)) {
+  if (!MODULE_RE.test(moduleCode) && !VIEW_RE.test(viewKey)) {
     throw new UserServiceError('VIEW_PREF_INVALID_KEY', undefined, { moduleCode, viewKey });
   }
killedBy: view-preference.service assertModuleView rejects invalid keys module=%p view=%p  view
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
src/domain/view-preference.service.ts:27:50
   }
 }
 
-function assertConfigSize(config: unknown): void {
-  const json = JSON.stringify(config ?? {});
-  if (Buffer.byteLength(json, 'utf8') > MAX_CONFIG_BYTES) {
-    throw new UserServiceError('VIEW_PREF_CONFIG_TOO_LARGE', undefined, { limit: MAX_CONFIG_BYTES });
-  }
-}
+function assertConfigSize(config: unknown): void {}
 
 export async function listForUser(
killedBy: view-preference.service upsert rejects oversized config
statusReason: promise resolved "undefined" instead of rejecting

[Killed] LogicalOperator
src/domain/view-preference.service.ts:28:31
 }
 
 function assertConfigSize(config: unknown): void {
-  const json = JSON.stringify(config ?? {});
+  const json = JSON.stringify(config && {});
   if (Buffer.byteLength(json, 'utf8') > MAX_CONFIG_BYTES) {
     throw new UserServiceError('VIEW_PREF_CONFIG_TOO_LARGE', undefined, { limit: MAX_CONFIG_BYTES });
killedBy: view-preference.service upsert rejects oversized config
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:29:7
 
 function assertConfigSize(config: unknown): void {
   const json = JSON.stringify(config ?? {});
-  if (Buffer.byteLength(json, 'utf8') > MAX_CONFIG_BYTES) {
+  if (true) {
     throw new UserServiceError('VIEW_PREF_CONFIG_TOO_LARGE', undefined, { limit: MAX_CONFIG_BYTES });
   }
killedBy: view-preference.service upsert inserts with tenant scoping
statusReason: Configuration exceeds size limit

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:29:7
 
 function assertConfigSize(config: unknown): void {
   const json = JSON.stringify(config ?? {});
-  if (Buffer.byteLength(json, 'utf8') > MAX_CONFIG_BYTES) {
+  if (false) {
     throw new UserServiceError('VIEW_PREF_CONFIG_TOO_LARGE', undefined, { limit: MAX_CONFIG_BYTES });
   }
killedBy: view-preference.service upsert rejects oversized config
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/domain/view-preference.service.ts:38:36
   tenantId: string,
   userId: string,
   moduleFilter?: string,
-): Promise<ViewPreferenceRecord[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $3' : '';
-      const params: unknown[] = [userId, tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2 ${where}
-          ORDER BY module_code ASC, view_key ASC`,
-        params,
-      );
-      return result.rows as ViewPreferenceRecord[];
-    });
-  } finally {
-    userMetrics.observeDb('viewPref.list', Date.now() - start);
-  }
-}
+): Promise<ViewPreferenceRecord[]> {}
 
 export async function getOne(
killedBy: view-preference.service getOne / listForUser / listShared / remove listForUser filters by module if provided
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/view-preference.service.ts:40:7
   moduleFilter?: string,
 ): Promise<ViewPreferenceRecord[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $3' : '';
-      const params: unknown[] = [userId, tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2 ${where}
-          ORDER BY module_code ASC, view_key ASC`,
-        params,
-      );
-      return result.rows as ViewPreferenceRecord[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('viewPref.list', Date.now() - start);
   }
killedBy: view-preference.service getOne / listForUser / listShared / remove listForUser filters by module if provided
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/view-preference.service.ts:41:58
 ): Promise<ViewPreferenceRecord[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $3' : '';
-      const params: unknown[] = [userId, tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2 ${where}
-          ORDER BY module_code ASC, view_key ASC`,
-        params,
-      );
-      return result.rows as ViewPreferenceRecord[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('viewPref.list', Date.now() - start);
killedBy: view-preference.service getOne / listForUser / listShared / remove listForUser filters by module if provided
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:44:11
     return await withTenantClient(tenantId, async (c) => {
       const where = moduleFilter ? 'AND module_code = $3' : '';
       const params: unknown[] = [userId, tenantId];
-      if (moduleFilter) params.push(moduleFilter);
+      if (true) params.push(moduleFilter);
       const result = await c.query(
         `SELECT module_code, view_key, config, is_shared, updated_at
killedBy: view-preference.service listForUser lists without moduleFilter → simple WHERE
statusReason: expected [ …(3) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:44:11
     return await withTenantClient(tenantId, async (c) => {
       const where = moduleFilter ? 'AND module_code = $3' : '';
       const params: unknown[] = [userId, tenantId];
-      if (moduleFilter) params.push(moduleFilter);
+      if (false) params.push(moduleFilter);
       const result = await c.query(
         `SELECT module_code, view_key, config, is_shared, updated_at
killedBy: view-preference.service getOne / listForUser / listShared / remove listForUser filters by module if provided
statusReason: expected [ …(2) ] to deeply equal [ …(3) ]

[Survived] BlockStatement
src/domain/view-preference.service.ts:54:13
       );
       return result.rows as ViewPreferenceRecord[];
     });
-  } finally {
-    userMetrics.observeDb('viewPref.list', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/view-preference.service.ts:55:44
       return result.rows as ViewPreferenceRecord[];
     });
   } finally {
-    userMetrics.observeDb('viewPref.list', Date.now() - start);
+    userMetrics.observeDb('viewPref.list', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/view-preference.service.ts:64:41
   userId: string,
   moduleCode: string,
   viewKey: string,
-): Promise<ViewPreferenceRecord | null> {
-  assertModuleView(moduleCode, viewKey);
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2
-            AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return (result.rows[0] as ViewPreferenceRecord) || null;
-    });
-  } finally {
-    userMetrics.observeDb('viewPref.getOne', Date.now() - start);
-  }
-}
+): Promise<ViewPreferenceRecord | null> {}
 
 export async function upsert(
killedBy: view-preference.service getOne / listForUser / listShared / remove getOne returns null when not found
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/view-preference.service.ts:67:7
 ): Promise<ViewPreferenceRecord | null> {
   assertModuleView(moduleCode, viewKey);
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2
-            AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return (result.rows[0] as ViewPreferenceRecord) || null;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('viewPref.getOne', Date.now() - start);
   }
killedBy: view-preference.service getOne / listForUser / listShared / remove getOne returns null when not found
statusReason: expected undefined to be null

[Killed] BlockStatement
src/domain/view-preference.service.ts:68:58
   assertModuleView(moduleCode, viewKey);
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2
-            AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return (result.rows[0] as ViewPreferenceRecord) || null;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('viewPref.getOne', Date.now() - start);
killedBy: view-preference.service getOne / listForUser / listShared / remove getOne returns null when not found
statusReason: expected undefined to be null

[Survived] StringLiteral
src/domain/view-preference.service.ts:70:9
   try {
     return await withTenantClient(tenantId, async (c) => {
       const result = await c.query(
-        `SELECT module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE user_id = $1::uuid AND tenant_id = $2
-            AND module_code = $3 AND view_key = $4`,
+        ``,
         [userId, tenantId, moduleCode, viewKey],
       );

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:76:14
             AND module_code = $3 AND view_key = $4`,
         [userId, tenantId, moduleCode, viewKey],
       );
-      return (result.rows[0] as ViewPreferenceRecord) || null;
+      return false;
     });
   } finally {
killedBy: view-preference.service getOne / listForUser / listShared / remove getOne returns null when not found
statusReason: expected false to be null

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:76:14
             AND module_code = $3 AND view_key = $4`,
         [userId, tenantId, moduleCode, viewKey],
       );
-      return (result.rows[0] as ViewPreferenceRecord) || null;
+      return true;
     });
   } finally {
killedBy: view-preference.service getOne / listForUser / listShared / remove getOne returns null when not found
statusReason: expected true to be null

[Survived] BlockStatement
src/domain/view-preference.service.ts:78:13
       );
       return (result.rows[0] as ViewPreferenceRecord) || null;
     });
-  } finally {
-    userMetrics.observeDb('viewPref.getOne', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/view-preference.service.ts:79:46
       return (result.rows[0] as ViewPreferenceRecord) || null;
     });
   } finally {
-    userMetrics.observeDb('viewPref.getOne', Date.now() - start);
+    userMetrics.observeDb('viewPref.getOne', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/view-preference.service.ts:79:27
       return (result.rows[0] as ViewPreferenceRecord) || null;
     });
   } finally {
-    userMetrics.observeDb('viewPref.getOne', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Survived] BooleanLiteral
src/domain/view-preference.service.ts:89:45
   moduleCode: string,
   viewKey: string,
   input: { config: Record<string, unknown>; isShared?: boolean | null },
-  opts: { canShare: boolean } = { canShare: false },
+  opts: { canShare: boolean } = { canShare: true },
 ): Promise<ViewPreferenceRecord> {
   assertModuleView(moduleCode, viewKey);

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:93:7
 ): Promise<ViewPreferenceRecord> {
   assertModuleView(moduleCode, viewKey);
   assertConfigSize(input.config);
-  if (input.isShared === true && !opts.canShare) {
+  if (false) {
     throw new UserServiceError('VIEW_PREF_SHARE_FORBIDDEN');
   }
killedBy: view-preference.service upsert blocks is_shared=true without share authority
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/domain/view-preference.service.ts:93:34
 ): Promise<ViewPreferenceRecord> {
   assertModuleView(moduleCode, viewKey);
   assertConfigSize(input.config);
-  if (input.isShared === true && !opts.canShare) {
+  if (input.isShared === true && opts.canShare) {
     throw new UserServiceError('VIEW_PREF_SHARE_FORBIDDEN');
   }
killedBy: view-preference.service upsert blocks is_shared=true without share authority
statusReason: promise resolved "undefined" instead of rejecting

[Killed] StringLiteral
src/domain/view-preference.service.ts:94:32
   assertModuleView(moduleCode, viewKey);
   assertConfigSize(input.config);
   if (input.isShared === true && !opts.canShare) {
-    throw new UserServiceError('VIEW_PREF_SHARE_FORBIDDEN');
+    throw new UserServiceError("");
   }
 
killedBy: view-preference.service upsert blocks is_shared=true without share authority
statusReason: expected TypeError: Cannot read properties of unde… to match object { …(2) }

[Killed] BlockStatement
src/domain/view-preference.service.ts:98:7
   }
 
   const start = Date.now();
-  try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO public.user_view_preferences
-           (user_id, tenant_id, module_code, view_key, config, is_shared, created_at, updated_at)
-         VALUES ($1::uuid, $2, $3, $4, $5::jsonb, COALESCE($6, FALSE), NOW(), NOW())
-         ON CONFLICT (tenant_id, user_id, module_code, view_key) DO UPDATE
-           SET config = EXCLUDED.config,
-               is_shared = EXCLUDED.is_shared,
-               updated_at = NOW()
-         RETURNING module_code, view_key, config, is_shared, updated_at`,
-        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config ?? {}), input.isShared ?? null],
-      );
-      return result.rows[0] as ViewPreferenceRecord;
-    });
-    userMetrics.viewPrefUpsert(tenantId);
-    return row;
-  } finally {
+  try {} finally {
     userMetrics.observeDb('viewPref.upsert', Date.now() - start);
   }
killedBy: view-preference.service upsert inserts with tenant scoping
statusReason: Cannot read properties of undefined (reading 'module_code')

[Killed] BlockStatement
src/domain/view-preference.service.ts:99:63
 
   const start = Date.now();
   try {
-    const row = await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `INSERT INTO public.user_view_preferences
-           (user_id, tenant_id, module_code, view_key, config, is_shared, created_at, updated_at)
-         VALUES ($1::uuid, $2, $3, $4, $5::jsonb, COALESCE($6, FALSE), NOW(), NOW())
-         ON CONFLICT (tenant_id, user_id, module_code, view_key) DO UPDATE
-           SET config = EXCLUDED.config,
-               is_shared = EXCLUDED.is_shared,
-               updated_at = NOW()
-         RETURNING module_code, view_key, config, is_shared, updated_at`,
-        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config ?? {}), input.isShared ?? null],
-      );
-      return result.rows[0] as ViewPreferenceRecord;
-    });
+    const row = await withTenantClient(tenantId, async (c) => {});
     userMetrics.viewPrefUpsert(tenantId);
     return row;
killedBy: view-preference.service upsert inserts with tenant scoping
statusReason: Cannot read properties of undefined (reading 'module_code')

[Killed] LogicalOperator
src/domain/view-preference.service.ts:109:64
                is_shared = EXCLUDED.is_shared,
                updated_at = NOW()
          RETURNING module_code, view_key, config, is_shared, updated_at`,
-        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config ?? {}), input.isShared ?? null],
+        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config && {}), input.isShared ?? null],
       );
       return result.rows[0] as ViewPreferenceRecord;
killedBy: view-preference.service upsert — null config defaults empty object when config undefined
statusReason: expected undefined to be '{}' // Object.is equality

[Survived] LogicalOperator
src/domain/view-preference.service.ts:109:85
                is_shared = EXCLUDED.is_shared,
                updated_at = NOW()
          RETURNING module_code, view_key, config, is_shared, updated_at`,
-        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config ?? {}), input.isShared ?? null],
+        [userId, tenantId, moduleCode, viewKey, JSON.stringify(input.config ?? {}), input.isShared && null],
       );
       return result.rows[0] as ViewPreferenceRecord;

[Survived] BlockStatement
src/domain/view-preference.service.ts:115:13
     });
     userMetrics.viewPrefUpsert(tenantId);
     return row;
-  } finally {
-    userMetrics.observeDb('viewPref.upsert', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/view-preference.service.ts:116:46
     userMetrics.viewPrefUpsert(tenantId);
     return row;
   } finally {
-    userMetrics.observeDb('viewPref.upsert', Date.now() - start);
+    userMetrics.observeDb('viewPref.upsert', Date.now() + start);
   }
 }

[Survived] StringLiteral
src/domain/view-preference.service.ts:116:27
     userMetrics.viewPrefUpsert(tenantId);
     return row;
   } finally {
-    userMetrics.observeDb('viewPref.upsert', Date.now() - start);
+    userMetrics.observeDb("", Date.now() - start);
   }
 }

[Killed] BlockStatement
src/domain/view-preference.service.ts:125:20
   userId: string,
   moduleCode: string,
   viewKey: string,
-): Promise<number> {
-  assertModuleView(moduleCode, viewKey);
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `DELETE FROM public.user_view_preferences
-           WHERE user_id = $1::uuid AND tenant_id = $2
-             AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return result.rowCount ?? 0;
-    });
-  } finally {
-    userMetrics.observeDb('viewPref.delete', Date.now() - start);
-  }
-}
+): Promise<number> {}
 
 export async function listShared(
killedBy: view-preference.service getOne / listForUser / listShared / remove remove returns affected row count
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/domain/view-preference.service.ts:128:7
 ): Promise<number> {
   assertModuleView(moduleCode, viewKey);
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `DELETE FROM public.user_view_preferences
-           WHERE user_id = $1::uuid AND tenant_id = $2
-             AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return result.rowCount ?? 0;
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('viewPref.delete', Date.now() - start);
   }
killedBy: view-preference.service getOne / listForUser / listShared / remove remove returns affected row count
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
src/domain/view-preference.service.ts:129:58
   assertModuleView(moduleCode, viewKey);
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const result = await c.query(
-        `DELETE FROM public.user_view_preferences
-           WHERE user_id = $1::uuid AND tenant_id = $2
-             AND module_code = $3 AND view_key = $4`,
-        [userId, tenantId, moduleCode, viewKey],
-      );
-      return result.rowCount ?? 0;
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('viewPref.delete', Date.now() - start);
killedBy: view-preference.service getOne / listForUser / listShared / remove remove returns affected row count
statusReason: expected undefined to be 1 // Object.is equality

[Killed] LogicalOperator
src/domain/view-preference.service.ts:136:14
              AND module_code = $3 AND view_key = $4`,
         [userId, tenantId, moduleCode, viewKey],
       );
-      return result.rowCount ?? 0;
+      return result.rowCount && 0;
     });
   } finally {
killedBy: view-preference.service getOne / listForUser / listShared / remove remove returns affected row count
statusReason: expected +0 to be 1 // Object.is equality

[Survived] BlockStatement
src/domain/view-preference.service.ts:138:13
       );
       return result.rowCount ?? 0;
     });
-  } finally {
-    userMetrics.observeDb('viewPref.delete', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/view-preference.service.ts:139:46
       return result.rowCount ?? 0;
     });
   } finally {
-    userMetrics.observeDb('viewPref.delete', Date.now() - start);
+    userMetrics.observeDb('viewPref.delete', Date.now() + start);
   }
 }

[Killed] BlockStatement
src/domain/view-preference.service.ts:146:42
 export async function listShared(
   tenantId: string,
   moduleFilter?: string,
-): Promise<SharedViewPreferenceRecord[]> {
-  const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $2' : '';
-      const params: unknown[] = [tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT user_id, module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE tenant_id = $1 AND is_shared = TRUE ${where}
-          ORDER BY module_code ASC, view_key ASC, updated_at DESC
-          LIMIT 500`,
-        params,
-      );
-      return result.rows as SharedViewPreferenceRecord[];
-    });
-  } finally {
-    userMetrics.observeDb('viewPref.listShared', Date.now() - start);
-  }
-}
+): Promise<SharedViewPreferenceRecord[]> {}
 
killedBy: view-preference.service getOne / listForUser / listShared / remove listShared applies tenant scope + shared filter
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/view-preference.service.ts:148:7
   moduleFilter?: string,
 ): Promise<SharedViewPreferenceRecord[]> {
   const start = Date.now();
-  try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $2' : '';
-      const params: unknown[] = [tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT user_id, module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE tenant_id = $1 AND is_shared = TRUE ${where}
-          ORDER BY module_code ASC, view_key ASC, updated_at DESC
-          LIMIT 500`,
-        params,
-      );
-      return result.rows as SharedViewPreferenceRecord[];
-    });
-  } finally {
+  try {} finally {
     userMetrics.observeDb('viewPref.listShared', Date.now() - start);
   }
killedBy: view-preference.service getOne / listForUser / listShared / remove listShared applies tenant scope + shared filter
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] BlockStatement
src/domain/view-preference.service.ts:149:58
 ): Promise<SharedViewPreferenceRecord[]> {
   const start = Date.now();
   try {
-    return await withTenantClient(tenantId, async (c) => {
-      const where = moduleFilter ? 'AND module_code = $2' : '';
-      const params: unknown[] = [tenantId];
-      if (moduleFilter) params.push(moduleFilter);
-      const result = await c.query(
-        `SELECT user_id, module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE tenant_id = $1 AND is_shared = TRUE ${where}
-          ORDER BY module_code ASC, view_key ASC, updated_at DESC
-          LIMIT 500`,
-        params,
-      );
-      return result.rows as SharedViewPreferenceRecord[];
-    });
+    return await withTenantClient(tenantId, async (c) => {});
   } finally {
     userMetrics.observeDb('viewPref.listShared', Date.now() - start);
killedBy: view-preference.service getOne / listForUser / listShared / remove listShared applies tenant scope + shared filter
statusReason: Cannot read properties of undefined (reading 'sql')

[Killed] ConditionalExpression
src/domain/view-preference.service.ts:152:11
     return await withTenantClient(tenantId, async (c) => {
       const where = moduleFilter ? 'AND module_code = $2' : '';
       const params: unknown[] = [tenantId];
-      if (moduleFilter) params.push(moduleFilter);
+      if (true) params.push(moduleFilter);
       const result = await c.query(
         `SELECT user_id, module_code, view_key, config, is_shared, updated_at
killedBy: view-preference.service getOne / listForUser / listShared / remove listShared applies tenant scope + shared filter
statusReason: expected [ 'tenant-a', undefined ] to deeply equal [ 'tenant-a' ]
