[Killed] ConditionalExpression
src/domain/view-preference.service.ts:152:11
     return await withTenantClient(tenantId, async (c) => {
       const where = moduleFilter ? 'AND module_code = $2' : '';
       const params: unknown[] = [tenantId];
-      if (moduleFilter) params.push(moduleFilter);
+      if (false) params.push(moduleFilter);
       const result = await c.query(
         `SELECT user_id, module_code, view_key, config, is_shared, updated_at
killedBy: view-preference.service listShared applies module filter when provided
statusReason: expected [ 'tenant-a' ] to deeply equal [ 'tenant-a', 'risk' ]

[Killed] StringLiteral
src/domain/view-preference.service.ts:154:9
       const params: unknown[] = [tenantId];
       if (moduleFilter) params.push(moduleFilter);
       const result = await c.query(
-        `SELECT user_id, module_code, view_key, config, is_shared, updated_at
-           FROM public.user_view_preferences
-          WHERE tenant_id = $1 AND is_shared = TRUE ${where}
-          ORDER BY module_code ASC, view_key ASC, updated_at DESC
-          LIMIT 500`,
+        ``,
         params,
       );
killedBy: view-preference.service getOne / listForUser / listShared / remove listShared applies tenant scope + shared filter
statusReason: expected '' to contain 'is_shared = TRUE'

[Survived] BlockStatement
src/domain/view-preference.service.ts:163:13
       );
       return result.rows as SharedViewPreferenceRecord[];
     });
-  } finally {
-    userMetrics.observeDb('viewPref.listShared', Date.now() - start);
-  }
+  } finally {}
 }
 

[Survived] ArithmeticOperator
src/domain/view-preference.service.ts:164:50
       return result.rows as SharedViewPreferenceRecord[];
     });
   } finally {
-    userMetrics.observeDb('viewPref.listShared', Date.now() - start);
+    userMetrics.observeDb('viewPref.listShared', Date.now() + start);
   }
 }
