[Killed] BlockStatement
src/events/publisher.ts:9:43
  * is not blocked on event delivery, but delivery failures MUST be surfaced in
  * logs (and therefore metrics via pino pipeline) so silent drops don't happen.
  */
-function emit(event: PlatformEvent): void {
-  publishEvent(event).catch((err: unknown) => {
-    logger.error('[user-service.publisher] publishEvent failed', {
-      eventType: event.eventType,
-      tenantId: event.tenantId,
-      entityId: event.entityId,
-      error: toErrorMessage(err),
-    });
-  });
-}
+function emit(event: PlatformEvent): void {}
 
 function now(): string {
killedBy: user-service publisher publishUserCreated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/events/publisher.ts:10:47
  * logs (and therefore metrics via pino pipeline) so silent drops don't happen.
  */
 function emit(event: PlatformEvent): void {
-  publishEvent(event).catch((err: unknown) => {
-    logger.error('[user-service.publisher] publishEvent failed', {
-      eventType: event.eventType,
-      tenantId: event.tenantId,
-      entityId: event.entityId,
-      error: toErrorMessage(err),
-    });
-  });
+  publishEvent(event).catch((err: unknown) => {});
 }
 
killedBy: user-service publisher logs when publish fails instead of silently swallowing
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/events/publisher.ts:11:18
  */
 function emit(event: PlatformEvent): void {
   publishEvent(event).catch((err: unknown) => {
-    logger.error('[user-service.publisher] publishEvent failed', {
+    logger.error("", {
       eventType: event.eventType,
       tenantId: event.tenantId,
killedBy: user-service publisher logs when publish fails instead of silently swallowing
statusReason: expected "spy" to be called with arguments: [ …(2) ]

Received: 

  1st spy call:

  Array [
-   "[user-service.publisher] publishEvent failed",

[Killed] BlockStatement
src/events/publisher.ts:20:24
   });
 }
 
-function now(): string {
-  return new Date().toISOString();
-}
+function now(): string {}
 
 export function publishUserCreated(tenantId: string, userId: string, data: Record<string, unknown>): void {
killedBy: user-service publisher user.created sets module=user, entityType=user, and data passthrough
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/events/publisher.ts:24:107
   return new Date().toISOString();
 }
 
-export function publishUserCreated(tenantId: string, userId: string, data: Record<string, unknown>): void {
-  emit({
-    module: 'user', event: 'user.created', eventType: 'user.created',
-    tenantId, entityType: 'user', entityId: userId, userId,
-    data, occurredAt: now(),
-  });
-}
+export function publishUserCreated(tenantId: string, userId: string, data: Record<string, unknown>): void {}
 
 export function publishUserUpdated(tenantId: string, userId: string, data: Record<string, unknown>): void {
killedBy: user-service publisher publishUserCreated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/events/publisher.ts:26:55
 
 export function publishUserCreated(tenantId: string, userId: string, data: Record<string, unknown>): void {
   emit({
-    module: 'user', event: 'user.created', eventType: 'user.created',
+    module: 'user', event: 'user.created', eventType: "",
     tenantId, entityType: 'user', entityId: userId, userId,
     data, occurredAt: now(),
killedBy: user-service publisher publishUserCreated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Killed] BlockStatement
src/events/publisher.ts:32:107
   });
 }
 
-export function publishUserUpdated(tenantId: string, userId: string, data: Record<string, unknown>): void {
-  emit({
-    module: 'user', event: 'user.updated', eventType: 'user.updated',
-    tenantId, entityType: 'user', entityId: userId, userId,
-    data, occurredAt: now(),
-  });
-}
+export function publishUserUpdated(tenantId: string, userId: string, data: Record<string, unknown>): void {}
 
 export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {
killedBy: user-service publisher publishUserUpdated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/events/publisher.ts:40:111
   });
 }
 
-export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {
-  emit({
-    module: 'user', event: 'user.deactivated', eventType: 'user.deactivated',
-    tenantId, entityType: 'user', entityId: userId, userId,
-    data, occurredAt: now(),
-  });
-}
+export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {}
 
 export function publishTeamMemberAdded(
killedBy: user-service publisher publishUserDeactivated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/events/publisher.ts:42:28
 
 export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {
   emit({
-    module: 'user', event: 'user.deactivated', eventType: 'user.deactivated',
+    module: 'user', event: "", eventType: 'user.deactivated',
     tenantId, entityType: 'user', entityId: userId, userId,
     data, occurredAt: now(),
killedBy: user-service publisher publishUserDeactivated emits correct envelope
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Survived] StringLiteral
src/events/publisher.ts:42:59
 
 export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {
   emit({
-    module: 'user', event: 'user.deactivated', eventType: 'user.deactivated',
+    module: 'user', event: 'user.deactivated', eventType: "",
     tenantId, entityType: 'user', entityId: userId, userId,
     data, occurredAt: now(),

[Survived] StringLiteral
src/events/publisher.ts:43:27
 export function publishUserDeactivated(tenantId: string, userId: string, data: Record<string, unknown>): void {
   emit({
     module: 'user', event: 'user.deactivated', eventType: 'user.deactivated',
-    tenantId, entityType: 'user', entityId: userId, userId,
+    tenantId, entityType: "", entityId: userId, userId,
     data, occurredAt: now(),
   });

[Killed] BlockStatement
src/events/publisher.ts:50:9
 
 export function publishTeamMemberAdded(
   tenantId: string, teamId: string, userId: string, actorId: string,
-): void {
-  emit({
-    module: 'user', event: 'team.member_added', eventType: 'team.member_added',
-    tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
-    data: { teamId, memberId: userId }, occurredAt: now(),
-  });
-}
+): void {}
 
 export function publishTeamMemberRemoved(
killedBy: user-service publisher publishTeamMemberAdded carries team + member in data
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Survived] StringLiteral
src/events/publisher.ts:52:13
   tenantId: string, teamId: string, userId: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'team.member_added', eventType: 'team.member_added',
+    module: "", event: 'team.member_added', eventType: 'team.member_added',
     tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),

[Survived] StringLiteral
src/events/publisher.ts:52:60
   tenantId: string, teamId: string, userId: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'team.member_added', eventType: 'team.member_added',
+    module: 'user', event: 'team.member_added', eventType: "",
     tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),

[Killed] StringLiteral
src/events/publisher.ts:53:27
 ): void {
   emit({
     module: 'user', event: 'team.member_added', eventType: 'team.member_added',
-    tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
+    tenantId, entityType: "", entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),
   });
killedBy: user-service publisher team.member_added sets entityType=team_member, userId=actor
statusReason: expected '' to be 'team_member' // Object.is equality

[Killed] BlockStatement
src/events/publisher.ts:60:9
 
 export function publishTeamMemberRemoved(
   tenantId: string, teamId: string, userId: string, actorId: string,
-): void {
-  emit({
-    module: 'user', event: 'team.member_removed', eventType: 'team.member_removed',
-    tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
-    data: { teamId, memberId: userId }, occurredAt: now(),
-  });
-}
+): void {}
 
 export function publishRoleAssigned(
killedBy: user-service publisher publishTeamMemberRemoved carries team + member in data
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/events/publisher.ts:62:28
   tenantId: string, teamId: string, userId: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'team.member_removed', eventType: 'team.member_removed',
+    module: 'user', event: "", eventType: 'team.member_removed',
     tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),
killedBy: user-service publisher publishTeamMemberRemoved carries team + member in data
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Survived] StringLiteral
src/events/publisher.ts:62:13
   tenantId: string, teamId: string, userId: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'team.member_removed', eventType: 'team.member_removed',
+    module: "", event: 'team.member_removed', eventType: 'team.member_removed',
     tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),

[Survived] StringLiteral
src/events/publisher.ts:63:27
 ): void {
   emit({
     module: 'user', event: 'team.member_removed', eventType: 'team.member_removed',
-    tenantId, entityType: 'team_member', entityId: teamId, userId: actorId,
+    tenantId, entityType: "", entityId: teamId, userId: actorId,
     data: { teamId, memberId: userId }, occurredAt: now(),
   });

[Killed] BlockStatement
src/events/publisher.ts:70:9
 
 export function publishRoleAssigned(
   tenantId: string, userId: string, roleCode: string, actorId: string,
-): void {
-  emit({
-    module: 'user', event: 'user.role_assigned', eventType: 'user.role_assigned',
-    tenantId, entityType: 'user', entityId: userId, userId: actorId,
-    data: { userId, roleCode }, occurredAt: now(),
-  });
-}
+): void {}
 
 export function publishRoleRevoked(
killedBy: user-service publisher publishRoleAssigned carries roleCode in data
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Survived] StringLiteral
src/events/publisher.ts:72:13
   tenantId: string, userId: string, roleCode: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'user.role_assigned', eventType: 'user.role_assigned',
+    module: "", event: 'user.role_assigned', eventType: 'user.role_assigned',
     tenantId, entityType: 'user', entityId: userId, userId: actorId,
     data: { userId, roleCode }, occurredAt: now(),

[Survived] StringLiteral
src/events/publisher.ts:73:27
 ): void {
   emit({
     module: 'user', event: 'user.role_assigned', eventType: 'user.role_assigned',
-    tenantId, entityType: 'user', entityId: userId, userId: actorId,
+    tenantId, entityType: "", entityId: userId, userId: actorId,
     data: { userId, roleCode }, occurredAt: now(),
   });

[Killed] BlockStatement
src/events/publisher.ts:80:9
 
 export function publishRoleRevoked(
   tenantId: string, userId: string, roleCode: string, actorId: string,
-): void {
-  emit({
-    module: 'user', event: 'user.role_revoked', eventType: 'user.role_revoked',
-    tenantId, entityType: 'user', entityId: userId, userId: actorId,
-    data: { userId, roleCode }, occurredAt: now(),
-  });
-}
+): void {}
 
killedBy: user-service publisher publishRoleRevoked emits the correct eventType
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 



Number of calls: 0

[Survived] StringLiteral
src/events/publisher.ts:82:60
   tenantId: string, userId: string, roleCode: string, actorId: string,
 ): void {
   emit({
-    module: 'user', event: 'user.role_revoked', eventType: 'user.role_revoked',
+    module: 'user', event: 'user.role_revoked', eventType: "",
     tenantId, entityType: 'user', entityId: userId, userId: actorId,
     data: { userId, roleCode }, occurredAt: now(),

[Survived] StringLiteral
src/events/publisher.ts:83:27
 ): void {
   emit({
     module: 'user', event: 'user.role_revoked', eventType: 'user.role_revoked',
-    tenantId, entityType: 'user', entityId: userId, userId: actorId,
+    tenantId, entityType: "", entityId: userId, userId: actorId,
     data: { userId, roleCode }, occurredAt: now(),
   });
